[
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5051887.jpg",
    "recipeName": "A Minnesotan\u0027s Beef and Macaroni Hotdish",
    "recipeUrl": "https://www.allrecipes.com/recipe/262326/a-minnesotans-beef-and-macaroni-hotdish/",
    "ingredients": [
      "1 pound ground beef",
      "2 cups elbow macaroni",
      "½ large green bell pepper, coarsely chopped",
      "½ large onion, chopped",
      "1 (16 ounce) can tomato sauce",
      "1 pound tomatoes, coarsely chopped",
      "2 teaspoons Worcestershire sauce",
      "1 teaspoon soy sauce",
      "1 teaspoon salt",
      "¾ teaspoon dried basil",
      "¾ teaspoon dried oregano",
      "½ teaspoon ground black pepper",
      "½ teaspoon chili powder",
      "¼ teaspoon garlic powder",
      "⅛ teaspoon hot pepper sauce (such as Tabasco®)",
      "1 cup beef broth"
    ],
    "cookingInstructions": [
      "Step 1 Cook beef in large skillet over medium heat, stirring occasionally, until browned, about 5 minutes. Transfer beef to a bowl. ",
      "Step 2 Cook macaroni, bell pepper, and onion in the same skillet over medium heat for 3 minutes. Add cooked beef, tomato sauce, tomatoes, Worcestershire sauce, soy sauce, salt, basil, oregano, ground black pepper, chili powder, garlic powder, and hot pepper sauce. Pour in beef broth. Cover skillet and simmer until macaroni is tender, about 15 minutes. Remove lid and simmer, stirring occasionally, until thickened, 5 to 10 minutes."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1100724.jpg",
    "recipeName": "Chicago-Inspired Italian Beef Sandwich",
    "recipeUrl": "https://www.allrecipes.com/recipe/236322/chicago-inspired-italian-beef-sandwich/",
    "ingredients": [
      "1 ½ pounds boneless beef chuck, cut into 2-inch pieces",
      "salt and ground black pepper to taste",
      "1 tablespoon vegetable oil",
      "6 cloves garlic, sliced",
      "2 tablespoons white vinegar",
      "1 tablespoon dried oregano",
      "1 ½ teaspoons salt, or to taste",
      "1 teaspoon dried thyme",
      "1 teaspoon dried rosemary",
      "1 teaspoon freshly ground black pepper",
      "1 bay leaf",
      "¼ teaspoon red pepper flakes, or to taste",
      "3 cups chicken broth, or as needed",
      "4 ciabatta rolls, sliced in half",
      "1 cup chopped giardiniera (pickled Italian vegetables)",
      "2 teaspoons chopped fresh flat-leaf parsley"
    ],
    "cookingInstructions": [
      "Step 1 Season beef with a pinch of salt and black pepper. Heat vegetable oil in a heavy pot over high heat. Cook and stir beef in hot oil until browned, 5 to 8 minutes. ",
      "Step 2 Stir garlic, vinegar, oregano, 1 1/2 teaspoons salt, thyme, rosemary, 1 teaspoon black pepper, bay leaf, and red pepper flakes into beef. Pour enough chicken broth into beef mixture to cover the meat by 1 inch and bring to a simmer.",
      "Step 3 Cover pot with a lid, reduce heat to low, and simmer until meat is fork-tender, 1 to 1 1/2 hours.",
      "Step 4 Transfer meat with a strainer or slotted spoon to a separate pot; pour about 1/4 cup of meat broth into pot. Use a wooden spoon to gently break meat into smaller chunks. Cover pot with a lid or aluminum foil and keep warm.",
      "Step 5 Skim excess grease from top of broth remaining in the first pot; season with salt and pepper to taste. Cover pot with a lid or aluminum foil and keep broth warm.",
      "Step 6 Lay halves of a roll out on a work surface and spoon 2 to 3 tablespoons meat broth over each half. Top bottom half of roll with a generous portion of meat and a spoonful of pickled vegetables. Place tops on sandwich. Repeat with remaining buns, broth, meat, and pickled vegetables to make 3 more sandwiches.",
      "Step 7 Spoon hot meat broth into ramekins and top each ramekin with 1/2 teaspoon parsley. Serve sandwiches with hot broth for dipping."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F845264.jpg",
    "recipeName": "The Real Deal Korean Beef Ribs",
    "recipeUrl": "https://www.allrecipes.com/recipe/158229/the-real-deal-korean-beef-ribs/",
    "ingredients": [
      "4 pounds Korean-style short ribs (beef chuck flanken, cut 1/3 to 1/2 inch thick across bones)",
      "½ cup reduced-sodium soy sauce",
      "½ cup white sugar",
      "2 tablespoons honey",
      "2 tablespoons minced garlic",
      "2 tablespoons ground black pepper",
      "3 tablespoons water",
      "1 tablespoon Asian (toasted) sesame oil",
      "1 ½ tablespoons Asian plum wine"
    ],
    "cookingInstructions": [
      "Step 1 Wash the ribs, removing any stray bits of bone, and allow to drain for 30 minutes. ",
      "Step 2 Whisk together the soy sauce, sugar, honey, garlic, pepper, water, sesame oil, and plum wine until the sugar has dissolved; pour the mixture into a 1 gallon plastic zipper bag. Place the ribs into the marinade, squeeze all the air out of the bag, zip it up, and refrigerate at least 24 hours.",
      "Step 3 The next day, remove the ribs from the refrigerator and allow to come to room temperature before grilling. Remove the ribs from the marinade and discard the marinade.",
      "Step 4 Preheat an outdoor grill for medium-high heat, and lightly oil the grate. Grill the ribs until browned and no longer pink inside, 4 to 6 minutes per side."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4030820.jpg",
    "recipeName": "Abuela\u0027s Picadillo",
    "recipeUrl": "https://www.allrecipes.com/recipe/255660/abuelas-picadillo/",
    "ingredients": [
      "2 pounds lean ground beef",
      "¼ cup olive oil",
      "½ onion, chopped",
      "½ green bell pepper, chopped",
      "2 tablespoons minced garlic",
      "2 (8 ounce) cans tomato sauce",
      "2 cups water",
      "½ cup red cooking wine",
      "3 tablespoons hot sauce (such as Louisiana®)",
      "1 (1.41 ounce) package sazon seasoning (such as Badia® Tropical®)",
      "1 tablespoon chopped fresh parsley",
      "½ teaspoon garlic powder",
      "½ teaspoon onion powder",
      "½ teaspoon ground cumin",
      "½ teaspoon ground black pepper",
      "¼ teaspoon ground bay leaf",
      "3 ounces Spanish-style olives",
      "1 teaspoon salt, or to taste",
      "1 small butternut squash, peeled and cut into cubes"
    ],
    "cookingInstructions": [
      "Step 1 Cook and stir ground beef in a large stockpot until browned, 5 to 10 minutes. Drain grease. ",
      "Step 2 Heat olive oil in small skillet over medium heat. Add onion, green bell pepper, and garlic; cook and stir until fragrant, 2 to 3 minutes. Stir into beef in the stockpot.",
      "Step 3 Pour tomato sauce, water, cooking wine, and hot sauce into the stockpot. Stir in sazon seasoning, parsley, garlic powder, onion powder, cumin, pepper, and bay leaf. Bring to a boil; reduce heat to low and simmer picadillo, uncovered, until slightly thickened, about 10 minutes.",
      "Step 4 Split olives in half with your fingers and stir into the picadillo. Add squash. Simmer until liquid reduces but picadillo is not dry, 45 to 60 minutes. Season with salt."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1044986.jpg",
    "recipeName": "Tennessee Meatloaf",
    "recipeUrl": "https://www.allrecipes.com/recipe/232247/tennessee-meatloaf/",
    "ingredients": [
      "½ cup ketchup",
      "¼ cup brown sugar",
      "2 tablespoons cider vinegar",
      "cooking spray",
      "1 onion, chopped",
      "½ green bell pepper, chopped",
      "2 cloves garlic, minced",
      "2 large eggs, lightly beaten",
      "1 teaspoon dried thyme",
      "1 teaspoon seasoned salt",
      "½ teaspoon ground black pepper",
      "2 teaspoons prepared mustard",
      "2 teaspoons Worcestershire sauce",
      "½ teaspoon hot pepper sauce (such as Tabasco®)",
      "½ cup milk",
      "⅔ cup quick cooking oats",
      "1 pound ground beef",
      "½ pound ground pork",
      "½ pound ground veal"
    ],
    "cookingInstructions": [
      "Step 1 Combine ketchup, brown sugar, and cider vinegar in a bowl; mix well. ",
      "Step 2 Preheat oven to 350 degrees F (175 degrees C). Spray two 9x5-inch loaf pans with cooking spray or line with aluminum foil for easier cleanup (see Cook\u0027s Note).",
      "Step 3 Place onion and green pepper in covered microwave container and cook until softened, 1 to 2 minutes. Set aside to cool.",
      "Step 4 In large mixing bowl, combine garlic, eggs, thyme, seasoned salt, black pepper, mustard, Worcestershire sauce, hot sauce, milk, and oats. Mix well. Stir in cooked onion and green pepper. Add ground beef, pork, and veal. With gloved hands, work all ingredients together until completely mixed and uniform.",
      "Step 5 Divide meatloaf mixture in half and pat half of mixture into each prepared loaf pan. Brush loaves with half of the glaze; set remainder of glaze aside.",
      "Step 6 Bake in preheated oven for 50 minutes. Remove pans from oven; carefully drain fat. Brush loaves with remaining glaze. Return to oven and bake for 10 minutes more. Remove pans from oven and allow meatloaf to stand for 15 minutes before slicing."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6282786.jpg",
    "recipeName": "Keema Aloo (Ground Beef and Potatoes)",
    "recipeUrl": "https://www.allrecipes.com/recipe/231026/keema-aloo-ground-beef-and-potatoes/",
    "ingredients": [
      "2 tablespoons extra-virgin olive oil",
      "1 extra-large Spanish onion, chopped",
      "2 tablespoons water (Optional)",
      "2 pounds lean ground beef",
      "4 cloves garlic, minced",
      "2 tablespoons grated fresh ginger root",
      "1 serrano chile pepper, finely chopped",
      "2 teaspoons chopped fresh cilantro",
      "1 tablespoon ground coriander",
      "1 ½ teaspoons salt",
      "1 ½ teaspoons ground cumin",
      "1 teaspoon ground cayenne pepper",
      "1 teaspoon ground turmeric",
      "1 (28 ounce) can diced tomatoes",
      "3 potatoes, peeled and diced",
      "1 cup frozen green peas",
      "1 teaspoon garam masala"
    ],
    "cookingInstructions": [
      "Step 1 Heat olive oil in a large saucepan over medium-high heat. Cook and stir onion in the hot oil until soft and beginning to brown, about 12 minutes. If browned bits of onion are stuck to the bottom of the pan, stir water into onion and stir to loosen the browned bits. ",
      "Step 2 Mix ground beef, garlic, ginger, serrano chile, and cilantro into pan; cook and stir until beef is browned and crumbly, 10 to 15 minutes. Reduce heat to medium-low. Stir coriander, salt, cumin, cayenne pepper, and turmeric into the beef; cook and stir until flavors blend, about 5 minutes. Add tomatoes and potatoes, cover pot, and simmer until potatoes are tender, about 15 minutes.",
      "Step 3 Mix green peas into dish and cook until sauce has slightly thickened and flavors have blended, 10 to 15 minutes. Sprinkle garam masala over the dish, cover, and let stand for 5 minutes before serving."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F343775.jpg",
    "recipeName": "Prime Rib Au Jus with Yorkshire Pudding",
    "recipeUrl": "https://www.allrecipes.com/recipe/160399/prime-rib-au-jus-with-yorkshire-pudding/",
    "ingredients": [
      "1 (5 pound) bone-in beef rib roast",
      "8 cloves garlic, quartered",
      "¾ teaspoon salt",
      "1 teaspoon freshly ground black pepper",
      "2 cups eggs",
      "2 cups milk",
      "1 pinch salt",
      "2 cups all-purpose flour",
      "½ cup pan drippings from prime rib",
      "½ cup white wine",
      "2 cups beef stock"
    ],
    "cookingInstructions": [
      "Step 1 Place the roast bone-side down in a roasting pan, and use a sharp paring knife to poke 24 small holes 1 inch deep all over the roast. Stuff each hole with a sliver of garlic. Sprinkle with 3/4 teaspoon salt, and LOTS of black pepper. Allow the roast to stand at room temperature for 2 hours. This will take the chill off and allow the meat to cook more evenly. ",
      "Step 2 Meanwhile, beat together the eggs and milk with a pinch of salt until smooth. Stir in flour until smooth. Cover the Yorkshire pudding batter, and place in the refrigerator.",
      "Step 3 Preheat oven to 450 degrees F (230 degrees C).",
      "Step 4 Cook the roast in the preheated oven for 30 minutes, then lower the heat to 350 degrees F (175 degrees C), and continue roasting until a meat thermometer inserted in the center of the meat reaches 140 degrees F (60 degrees C), about 1 hour.",
      "Step 5 When the roast is done, remove it from the roasting pan, cover with aluminum foil, and let rest in a warm spot while you make the Yorkshire pudding. Measure out 1/2 cup of the beef fat, and divide among 12 muffin tins; pour off the remaining fat, but save the roasting pan to make the jus.",
      "Step 6 Place the grease-filled muffin tins into the oven, and turn the temperature up to 425 degrees F (220 degrees C). Let the muffin tins preheat for 10 minutes, then fill 3/4 full with the refrigerated batter, and return to the oven. Bake 20 to 25 minutes until the puddings have risen tall and are golden brown.",
      "Step 7 While the Yorkshire puddings are baking, place the roasting pan on the stove over medium-high heat. Stir in the wine, and bring to a simmer while scraping to dissolve the pan drippings; pour in the beef stock and return to a simmer. Cook 10 minutes, then strain and serve with the roast and puddings."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3372675.jpg",
    "recipeName": "Grilled Steak Tips with Chimichurri",
    "recipeUrl": "https://www.allrecipes.com/recipe/246548/grilled-steak-tips-with-chimichurri/",
    "ingredients": [
      "1 pound beef tips, or more to taste",
      "1 tablespoon canola oil",
      "salt and ground black pepper to taste",
      "1 cup minced flat-leaf parsley",
      "½ cup olive oil",
      "¼ cup red wine vinegar",
      "1 small red onion, minced",
      "3 cloves garlic, minced",
      "2 tablespoons pureed chipotle peppers in adobo sauce",
      "2 tablespoons smoked paprika",
      "1 tablespoon dried oregano"
    ],
    "cookingInstructions": [
      "Step 1 Preheat an outdoor grill for high heat and lightly oil the grate. ",
      "Step 2 Toss beef tips with canola oil in a bowl; season with salt and pepper.",
      "Step 3 Grill steak tips until they are beginning to firm but still slightly pink in the center, 2 to 3 minutes per side.",
      "Step 4 Mix parsley, olive oil, red wine vinegar, red onion, garlic, chipotle peppers, paprika, and oregano together in a bowl; toss with grilled steak tips."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F06%2F19%2FEasy-Meatloaf.jpg",
    "recipeName": "Easy Meatloaf",
    "recipeUrl": "https://www.allrecipes.com/recipe/16354/easy-meatloaf/",
    "ingredients": [
      "1 ½ pounds ground beef",
      "1 egg",
      "1 onion, chopped",
      "1 cup milk",
      "1 cup dried bread crumbs",
      "salt and pepper to taste",
      "2 tablespoons brown sugar",
      "2 tablespoons prepared mustard",
      "⅓ cup ketchup"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 350 degrees F (175 degrees C). ",
      "Step 2 In a large bowl, combine the beef, egg, onion, milk and bread OR cracker crumbs. Season with salt and pepper to taste and place in a lightly greased 9x5-inch loaf pan, or form into a loaf and place in a lightly greased 9x13-inch baking dish.",
      "Step 3 In a separate small bowl, combine the brown sugar, mustard and ketchup. Mix well and pour over the meatloaf.",
      "Step 4 Bake at 350 degrees F (175 degrees C) for 1 hour."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F07%2F11%2Fworlds-best-lasagna.jpeg",
    "recipeName": "World\u0027s Best Lasagna",
    "recipeUrl": "https://www.allrecipes.com/recipe/23600/worlds-best-lasagna/",
    "ingredients": [
      "1 pound sweet Italian sausage",
      "¾ pound lean ground beef",
      "½ cup minced onion",
      "2 cloves garlic, crushed",
      "1 (28 ounce) can crushed tomatoes",
      "2 (6 ounce) cans tomato paste",
      "2 (6.5 ounce) cans canned tomato sauce",
      "½ cup water",
      "2 tablespoons white sugar",
      "1 ½ teaspoons dried basil leaves",
      "½ teaspoon fennel seeds",
      "1 teaspoon Italian seasoning",
      "1 ½ teaspoons salt, divided, or to taste",
      "¼ teaspoon ground black pepper",
      "4 tablespoons chopped fresh parsley",
      "12 lasagna noodles",
      "16 ounces ricotta cheese",
      "1 egg",
      "¾ pound mozzarella cheese, sliced",
      "¾ cup grated Parmesan cheese"
    ],
    "cookingInstructions": [
      "Step 1 In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 teaspoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally. ",
      "Step 2 Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water. In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt.",
      "Step 3 Preheat oven to 375 degrees F (190 degrees C).",
      "Step 4 To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13-inch baking dish. Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese. Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese.",
      "Step 5 Bake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4886145.jpg",
    "recipeName": "Chef John\u0027s Perfect Prime Rib",
    "recipeUrl": "https://www.allrecipes.com/recipe/221958/chef-johns-perfect-prime-rib/",
    "ingredients": [
      "4 pounds prime rib roast",
      "¼ cup unsalted butter, softened",
      "1 tablespoon freshly ground black pepper",
      "1 teaspoon herbes de Provence",
      "kosher salt"
    ],
    "cookingInstructions": [
      "Step 1 Place rib roast on a plate and bring to room temperature, about 4 hours. ",
      "Step 2 Preheat an oven to 500 degrees F (260 degrees C).",
      "Step 3 Combine butter, pepper, and herbes de Provence in a bowl; mix until well blended. Spread butter mixture evenly over entire roast. Season roast generously with kosher salt.",
      "Step 4 Roast the 4-pound prime rib (see footnote if using a larger and smaller roast) in the preheated oven for 20 minutes. Turn the oven off and, leaving the roast in the oven with the door closed, let the roast sit in the oven for 2 hours. Remove roast from the oven, slice, and serve."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2630776.jpg",
    "recipeName": "Asian Lettuce Wraps",
    "recipeUrl": "https://www.allrecipes.com/recipe/71722/asian-lettuce-wraps/",
    "ingredients": [
      "16 Boston Bibb or butter lettuce leaves",
      "1 pound lean ground beef",
      "1 tablespoon cooking oil",
      "1 large onion, chopped",
      "¼ cup hoisin sauce",
      "2 cloves fresh garlic, minced",
      "1 tablespoon soy sauce",
      "1 tablespoon rice wine vinegar",
      "2 teaspoons minced pickled ginger",
      "1 dash Asian chile pepper sauce, or to taste (Optional)",
      "1 (8 ounce) can water chestnuts, drained and finely chopped",
      "1 bunch green onions, chopped",
      "2 teaspoons Asian (dark) sesame oil"
    ],
    "cookingInstructions": [
      "Step 1 Rinse whole lettuce leaves and pat dry, being careful not tear them. Set aside. ",
      "Step 2 Heat a large skillet over medium-high heat. Cook and stir beef and cooking oil in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease; transfer beef to a bowl. Cook and stir onion in the same skillet used for beef until slightly tender, 5 to 10 minutes. Stir hoisin sauce, garlic, soy sauce, vinegar, ginger, and chile pepper sauce into onions. Add water chestnuts, green onions, sesame oil, and cooked beef; cook and stir until the onions just begin to wilt, about 2 minutes.",
      "Step 3 Arrange lettuce leaves around the outer edge of a large serving platter and pile meat mixture in the center."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8960042.jpg",
    "recipeName": "Michele\u0027s Ground Beef Casserole",
    "recipeUrl": "https://www.allrecipes.com/recipe/228680/micheles-ground-beef-casserole/",
    "ingredients": [
      "1 pound ground beef",
      "½ pound bulk hot Italian sausage",
      "1 onion, chopped",
      "1 bell pepper, chopped",
      "2 tablespoons all-purpose flour",
      "1 teaspoon salt",
      "¼ teaspoon dried oregano",
      "⅛ teaspoon ground black pepper, or to taste",
      "1 (26 ounce) jar spaghetti sauce",
      "1 (16 ounce) package frozen mixed vegetables, thawed",
      "1 (8 ounce) package refrigerated crescent roll dough",
      "1 cup shredded Cheddar cheese"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 350 degrees F (175 degrees C). Grease a 13x9-inch baking dish. ",
      "Step 2 Cook and stir ground beef, sausage, onion, and bell pepper together in a large skillet over medium heat until the beef and sausage are completely browned and crumbled, 7 to 10 minutes. Drain grease from skillet and return to heat.",
      "Step 3 Stir flour, salt, oregano, and black pepper into the beef mixture. Pour spaghetti sauce over the mixture. Add mixed vegetables; bring mixture to a simmer and cook for 5 minutes. Transfer mixture to prepared baking dish.",
      "Step 4 Roll crescent dough into a flat layer atop the beef mixture; sprinkle with Cheddar cheese.",
      "Step 5 Bake in preheated oven until the dough is golden and the cheese is melted, about 30 minutes."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F276397.jpg",
    "recipeName": "Slow Cooker Beef Stew I",
    "recipeUrl": "https://www.allrecipes.com/recipe/14685/slow-cooker-beef-stew-i/",
    "ingredients": [
      "2 pounds beef stew meat, cut into 1-inch pieces",
      "¼ cup all-purpose flour",
      "½ teaspoon salt",
      "½ teaspoon ground black pepper",
      "1 clove garlic, minced",
      "1 bay leaf",
      "1 teaspoon paprika",
      "1 teaspoon Worcestershire sauce",
      "1 onion, chopped",
      "1 ½ cups beef broth",
      "3 potatoes, diced",
      "4 carrots, sliced",
      "1 stalk celery, chopped"
    ],
    "cookingInstructions": [
      "Step 1 Place meat in slow cooker. In a small bowl mix together the flour, salt, and pepper; pour over meat, and stir to coat meat with flour mixture. Stir in the garlic, bay leaf, paprika, Worcestershire sauce, onion, beef broth, potatoes, carrots, and celery. ",
      "Step 2 Cover, and cook on Low setting for 10 to 12 hours, or on High setting for 4 to 6 hours."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1340290.jpg",
    "recipeName": "Reuben Sandwich II",
    "recipeUrl": "https://www.allrecipes.com/recipe/47717/reuben-sandwich-ii/",
    "ingredients": [
      "2 tablespoons butter",
      "8 slices rye bread",
      "8 slices deli sliced corned beef",
      "8 slices Swiss cheese",
      "1 cup sauerkraut, drained",
      "½ cup Thousand Island dressing"
    ],
    "cookingInstructions": [
      "Step 1 Preheat a large skillet or griddle on medium heat. ",
      "Step 2 Lightly butter one side of bread slices. Spread non-buttered sides with Thousand Island dressing. On 4 bread slices, layer 1 slice Swiss cheese, 2 slices corned beef, 1/4 cup sauerkraut and second slice of Swiss cheese. Top with remaining bread slices, buttered sides out.",
      "Step 3 Grill sandwiches until both sides are golden brown, about 5 minutes per side. Serve hot."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3274511.jpg",
    "recipeName": "Mom Sykes\u0027 Hungarian Goulash",
    "recipeUrl": "https://www.allrecipes.com/recipe/55243/mom-sykes-hungarian-goulash/",
    "ingredients": [
      "3 tablespoons butter",
      "2 pounds cubed beef stew meat",
      "1 pinch caraway seeds (Optional)",
      "1 pound onion, sliced",
      "2 teaspoons paprika",
      "1 clove garlic, minced",
      "1 tablespoon lemon zest",
      "1 (6 ounce) can tomato paste",
      "1 (10.5 ounce) can beef consomme",
      "1 (10 ounce) package broad egg noodles, cooked, rinsed, drained (Kosher for Passover)"
    ],
    "cookingInstructions": [
      "Step 1 Melt butter in a large pot over medium heat. Add the stew meat, caraway seeds, onion and paprika. Cook and stir until the meat is browned, and the onions are translucent. Add the garlic and lemon zest, and cook for about a minute, then stir in the tomato paste and beef consomme, adding water if necessary to cover the meat. Cover, and simmer over medium-low heat for 1 1/2 hours. ",
      "Step 2 Just before the meat is done cooking, bring a large pot of salted water to a boil. Add egg noodles, and cook until tender, about 8 minutes. Drain and serve the goulash spooned over the egg noodles."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7557288.jpg",
    "recipeName": "Cast Iron Pan-Seared Steak (Oven-Finished)",
    "recipeUrl": "https://www.allrecipes.com/recipe/262181/cast-iron-pan-seared-steak-oven-finished/",
    "ingredients": [
      "2 (6 ounce) beef top sirloin steaks",
      "2 cups orange juice",
      "1 cup apple cider vinegar",
      "½ cup Worcestershire sauce",
      "2 teaspoons olive oil",
      "1 ½ tablespoons steak seasoning (such as Fiesta Brand® Uncle Chris\u0027), or to taste",
      "freshly ground black pepper to taste",
      "sea salt to taste"
    ],
    "cookingInstructions": [
      "Step 1 Place steaks side by side in large casserole dish. Add orange juice, cider vinegar, and Worcestershire sauce. Refrigerate, uncovered, for 45 minutes. ",
      "Step 2 Preheat the oven to 425 degrees F (220 degrees C).",
      "Step 3 Remove casserole dish from refrigerator. Cover steaks with plastic wrap and let reach room temperature, at least 15 minutes.",
      "Step 4 Heat olive oil in a cast-iron skillet over high heat.",
      "Step 5 Place steaks on a clean work surface and generously rub with steak seasoning and black pepper.",
      "Step 6 Cook steaks in the hot skillet until lightly browned on the bottom, 2 1/2 minutes. Flip and cook until browned on the other side and red in the center, about 2 minutes more. Place skillet, with steaks, into the oven.",
      "Step 7 Bake in the preheated oven until steaks are firm and reddish-pink to lightly pink in the center, 8 to 10 minutes. An instant-read thermometer inserted into the center should read from 130 degrees F (54 degrees C) to 140 degrees F (60 degrees C).",
      "Step 8 Remove steaks from oven; season with salt. Let sit for 5 minutes before serving."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4482008.jpg",
    "recipeName": "Tatertot Casserole",
    "recipeUrl": "https://www.allrecipes.com/recipe/222037/tatertot-casserole/",
    "ingredients": [
      "1 pound ground beef",
      "1 pinch salt and ground black pepper to taste",
      "1 (10.75 ounce) can condensed cream of mushroom soup",
      "2 cups shredded Cheddar cheese",
      "1 (16 ounce) package frozen tater tots"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 350 degrees F (175 degrees C). ",
      "Step 2 Cook and stir ground beef in a large skillet over medium heat until no longer pink and completely browned, 7 to 10 minutes; season with salt and black pepper. Stir cream of mushroom soup into the cooked ground beef; pour the mixture into a 9x13-inch baking dish. Layer tater tots evenly over the ground beef mixture; top with Cheddar cheese.",
      "Step 3 Bake until tater tots are golden brown and hot, 30 to 45 minutes."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4528937.jpg",
    "recipeName": "Garbage Soup",
    "recipeUrl": "https://www.allrecipes.com/recipe/13295/garbage-soup/",
    "ingredients": [
      "1 pound lean ground beef",
      "6 potatoes, diced",
      "1 (14.5 ounce) can diced tomatoes",
      "1 onion, chopped",
      "1 cup chopped celery",
      "1 (10.5 ounce) can beef broth",
      "2 cups mixed vegetables",
      "salt and pepper to taste",
      "⅛ tablespoon dried rosemary",
      "⅛ tablespoon dried thyme",
      "¼ tablespoon dried basil",
      "½ pound bacon - cooked and crumbled"
    ],
    "cookingInstructions": [
      "Step 1 In a large stock pot place beef, potatoes, tomatoes, onion, celery, broth and vegetables. Add enough water to cover ingredients, cover pot and cook over medium heat for 1 hour or until vegetables are soft and beef is cooked through. ",
      "Step 2 Season to taste with salt and pepper, rosemary, thyme and basil. Add bacon bits, stir and serve."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F747244.jpg",
    "recipeName": "Sloppy Joes II",
    "recipeUrl": "https://www.allrecipes.com/recipe/24264/sloppy-joes-ii/",
    "ingredients": [
      "1 pound lean ground beef",
      "¼ cup chopped onion",
      "¼ cup chopped green bell pepper",
      "½ teaspoon garlic powder",
      "1 teaspoon prepared yellow mustard",
      "¾ cup ketchup",
      "3 teaspoons brown sugar",
      "salt to taste",
      "ground black pepper to taste"
    ],
    "cookingInstructions": [
      "Step 1 In a medium skillet over medium heat, brown the ground beef, onion, and green pepper; drain off liquids. ",
      "Step 2 Stir in the garlic powder, mustard, ketchup, and brown sugar; mix thoroughly. Reduce heat, and simmer for 30 minutes. Season with salt and pepper."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F265924.jpg",
    "recipeName": "The Best Meatloaf I\u0027ve Ever Made",
    "recipeUrl": "https://www.allrecipes.com/recipe/74360/the-best-meatloaf-ive-ever-made/",
    "ingredients": [
      "1 tablespoon butter",
      "¼ cup minced onion",
      "2 cloves garlic, minced",
      "1 ½ teaspoons salt",
      "1 ½ teaspoons freshly ground black pepper",
      "2 pounds extra-lean ground beef",
      "3 slices bread, toasted and crumbled",
      "7 buttery round crackers, crushed",
      "1 egg, lightly beaten",
      "3 ½ tablespoons sour cream",
      "1 ½ tablespoons Worcestershire sauce",
      "1 (15 ounce) can tomato sauce, divided",
      "¼ cup milk (Optional)",
      "3 tablespoons ketchup"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 350 degrees F (175 degrees C). ",
      "Step 2 Melt the butter in a skillet over medium heat, and cook the onion and garlic 5 minutes, until onion is tender. Remove from heat, and season with salt and pepper.",
      "Step 3 In a large bowl, mix the onion and garlic, beef, crumbled bread, crushed crackers, egg, sour cream, Worcestershire sauce, and 1/2 can tomato sauce. Gradually stir in the milk 1 teaspoon at a time until mixture is moist, but not soggy. Transfer the mixture to a 5x9 inch loaf pan.",
      "Step 4 Bake uncovered in the preheated oven 40 minutes. Increase oven temperature to 400 degrees F (200 degrees C), and continue baking 15 minutes, to an internal temperature of 160 degrees F (70 degrees C).",
      "Step 5 In a small bowl, mix the remaining tomato sauce and ketchup. Pour over the top of the meatloaf, and continue baking 10 minutes."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F667748.jpg",
    "recipeName": "Spaghetti Sauce with Ground Beef",
    "recipeUrl": "https://www.allrecipes.com/recipe/158140/spaghetti-sauce-with-ground-beef/",
    "ingredients": [
      "1 pound ground beef",
      "1 onion, chopped",
      "4 cloves garlic, minced",
      "1 small green bell pepper, diced",
      "1 (28 ounce) can diced tomatoes",
      "1 (16 ounce) can tomato sauce",
      "1 (6 ounce) can tomato paste",
      "2 teaspoons dried oregano",
      "2 teaspoons dried basil",
      "1 teaspoon salt",
      "½ teaspoon black pepper"
    ],
    "cookingInstructions": [
      "Step 1 Combine ground beef, onion, garlic, and green pepper in a large saucepan. Cook and stir until meat is brown and vegetables are tender. Drain grease. ",
      "Step 2 Stir diced tomatoes, tomato sauce, and tomato paste into the pan. Season with oregano, basil, salt, and pepper. Simmer spaghetti sauce for 1 hour, stirring occasionally."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6414064.jpg",
    "recipeName": "Instant Pot® Italian Wedding Soup",
    "recipeUrl": "https://www.allrecipes.com/recipe/270310/instant-pot-italian-wedding-soup/",
    "ingredients": [
      "1 tablespoon olive oil",
      "1 ½ cups chopped carrots",
      "1 cup sliced celery",
      "½ cup diced red onion",
      "1 teaspoon dried parsley",
      "¼ teaspoon dried basil",
      "¼ teaspoon ground black pepper",
      "6 cups no-salt-added chicken broth",
      "20 Italian meatballs, preferably home made",
      "½ cup pastina pasta",
      "6 ounces baby spinach",
      "4 teaspoons grated Parmesan cheese",
      "salt to taste"
    ],
    "cookingInstructions": [
      "Step 1 Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function. Pour in oil and heat until hot. Add carrots, celery, and red onion; cook until tender, 4 to 5 minutes. Season with parsley, basil, and pepper. Pour in chicken broth and add meatballs. Close and lock the lid. Close the valve and select the Soup function according to manufacturer\u0027s instructions; set timer for 3 minutes. Allow 10 to 15 minutes for pressure to build. ",
      "Step 2 Release pressure carefully using the quick-release method according to manufacturer\u0027s instructions, about 5 minutes. Unlock and remove the lid. Add pastina and stir to combine. Replace the lid. Close the valve and select the Soup function according to manufacturer\u0027s instructions; set timer for 3 minutes. Allow 10 to 15 minutes for pressure to build.",
      "Step 3 Release pressure carefully using the quick-release method according to manufacturer\u0027s instructions, about 5 minutes. Add spinach and stir. Let soup sit for 5 minutes so pasta will be fully cooked and spinach will be wilted. Season with salt to taste.",
      "Step 4 Ladle into bowls and top with Parmesan cheese."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1592917.jpg",
    "recipeName": "Slow Cooker Hamburger Soup with Macaroni",
    "recipeUrl": "https://www.allrecipes.com/recipe/282402/slow-cooker-hamburger-soup-with-macaroni/",
    "ingredients": [
      "1 pound lean ground beef",
      "4 ½ cups water",
      "½ (32 fluid ounce) container beef broth",
      "1 (28 ounce) can crushed tomatoes",
      "1 (15.25 ounce) can whole kernel sweet corn (such as Green Giant® Niblets®), undrained",
      "1 cup frozen lima beans",
      "¾ cup barley",
      "2 stalks celery, thinly sliced",
      "1 medium onion, chopped",
      "1 cube beef bouillon",
      "1 teaspoon ground paprika",
      "½ teaspoon Italian seasoning",
      "1 bay leaf",
      "2 cups elbow macaroni",
      "1 tablespoon chopped fresh parsley, or to taste"
    ],
    "cookingInstructions": [
      "Step 1 Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain off any excess grease. Transfer beef to a slow cooker. ",
      "Step 2 Add water, broth, tomatoes, corn, lima beans, barley, celery, onion, bouillon, paprika, Italian seasoning, and bay leaf to the slow cooker.",
      "Step 3 Cook on Low for 6 hours.",
      "Step 4 Just before serving, bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally, until tender yet firm to the bite, about 8 minutes. Drain.",
      "Step 5 Add cooked macaroni to the soup. Stir until combined and heated through. Serve immediately garnished with parsley."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4465996.jpg",
    "recipeName": "Chef John\u0027s Hot Sloppy Joe Dip",
    "recipeUrl": "https://www.allrecipes.com/recipe/257030/chef-johns-hot-sloppy-joe-dip/",
    "ingredients": [
      "2 pounds extra lean ground beef",
      "2 green bell peppers, diced",
      "1 onion, diced",
      "4 cloves garlic, minced",
      "3 tablespoons all-purpose flour",
      "2 tablespoons brown sugar",
      "2 teaspoons kosher salt, or to taste",
      "1 teaspoon ground black pepper",
      "cayenne pepper, to taste",
      "2 cups chicken broth",
      "1 cup ketchup",
      "1 tablespoon Dijon mustard",
      "1 teaspoon Worcestershire sauce",
      "1 cup shredded Cheddar cheese, divided"
    ],
    "cookingInstructions": [
      "Step 1 Place ground beef, bell pepper, onion, garlic, flour, brown sugar, salt, pepper, and cayenne pepper in a heavy pot. ",
      "Step 2 Place pot over medium-high heat. Break up and stir mixture as it heats. Cook and stir until most of the moisture has evaporated and mixture is crumbly and begins to brown, about 15 minutes. Stir in chicken broth, ketchup, mustard, and Worcestershire sauce. Mix well and bring mixture to a simmer. Reduce heat to medium. Cook, stirring occasionally, until mixture is thick, about 45 minutes.",
      "Step 3 Set oven rack about 6 inches from the heat source and preheat the oven\u0027s broiler.",
      "Step 4 Transfer mixture to oven-proof sauce pan. Top with 1/2 of the shredded cheese. Poke cheese down into the dip with a fork, stirring lightly. Top with remaining cheese.",
      "Step 5 Place pan under broiler; broil until cheese is browned, and mixture is hot and bubbly, about 5 minutes."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F376047.jpg",
    "recipeName": "Salisbury Steak",
    "recipeUrl": "https://www.allrecipes.com/recipe/14595/salisbury-steak/",
    "ingredients": [
      "1 (10.5 ounce) can condensed French onion soup",
      "1 ½ pounds ground beef",
      "½ cup dry bread crumbs",
      "1 egg",
      "¼ teaspoon salt",
      "⅛ teaspoon ground black pepper",
      "1 tablespoon all-purpose flour",
      "¼ cup ketchup",
      "¼ cup water",
      "1 tablespoon Worcestershire sauce",
      "½ teaspoon mustard powder"
    ],
    "cookingInstructions": [
      "Step 1 In a large bowl, mix together 1/3 cup condensed French onion soup with ground beef, bread crumbs, egg, salt and black pepper. Shape into 6 oval patties. ",
      "Step 2 In a large skillet over medium-high heat, brown both sides of patties. Pour off excess fat.",
      "Step 3 In a small bowl, blend flour and remaining soup until smooth. Mix in ketchup, water, Worcestershire sauce and mustard powder. Pour over meat in skillet. Cover, and cook for 20 minutes, stirring occasionally."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F998551.jpg",
    "recipeName": "Stuffed Cabbage Rolls",
    "recipeUrl": "https://www.allrecipes.com/recipe/26661/stuffed-cabbage-rolls/",
    "ingredients": [
      "⅔ cup water",
      "⅓ cup uncooked white rice",
      "8 cabbage leaves",
      "1 pound lean ground beef",
      "¼ cup chopped onion",
      "1 egg, slightly beaten",
      "1 teaspoon salt",
      "¼ teaspoon ground black pepper",
      "1 (10.75 ounce) can condensed tomato soup"
    ],
    "cookingInstructions": [
      "Step 1 In a medium saucepan, bring water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes. ",
      "Step 2 Bring a large, wide saucepan of lightly salted water to a boil. Add cabbage leaves and cook for 2 to 4 minutes or until softened; drain.",
      "Step 3 In a medium mixing bowl, combine the ground beef, 1 cup cooked rice, onion, egg, salt and pepper, along with 2 tablespoons of tomato soup. Mix thoroughly.",
      "Step 4 Divide the beef mixture evenly among the cabbage leaves. Roll and secure them with toothpicks or string.",
      "Step 5 In a large skillet over medium heat, place the cabbage rolls and pour the remaining tomato soup over the top. Cover and bring to a boil. Reduce heat to low and simmer for about 40 minutes, stirring and basting with the liquid often."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4557541.jpg",
    "recipeName": "Baked Ziti I",
    "recipeUrl": "https://www.allrecipes.com/recipe/11758/baked-ziti-i/",
    "ingredients": [
      "1 pound dry ziti pasta",
      "1 onion, chopped",
      "1 pound lean ground beef",
      "2 (26 ounce) jars spaghetti sauce",
      "6 ounces provolone cheese, sliced",
      "1 ½ cups sour cream",
      "6 ounces mozzarella cheese, shredded",
      "2 tablespoons grated Parmesan cheese"
    ],
    "cookingInstructions": [
      "Step 1 Bring a large pot of lightly salted water to a boil. Add ziti pasta, and cook until al dente, about 8 minutes; drain. ",
      "Step 2 In a large skillet, brown onion and ground beef over medium heat. Add spaghetti sauce, and simmer 15 minutes.",
      "Step 3 Preheat the oven to 350 degrees F (175 degrees C). Butter a 9x13 inch baking dish. Layer as follows: 1/2 of the ziti, Provolone cheese, sour cream, 1/2 sauce mixture, remaining ziti, mozzarella cheese and remaining sauce mixture. Top with grated Parmesan cheese.",
      "Step 4 Bake for 30 minutes in the preheated oven, or until cheeses are melted."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F419304.jpg",
    "recipeName": "Hamburger Potato Casserole",
    "recipeUrl": "https://www.allrecipes.com/recipe/26609/hamburger-potato-casserole/",
    "ingredients": [
      "1 pound lean ground beef",
      "3 cups peeled and thinly sliced potatoes",
      "1 (10.75 ounce) can condensed cream of mushroom soup",
      "½ cup chopped onion",
      "¾ cup milk",
      "salt to taste",
      "freshly ground pepper, to taste",
      "1 cup shredded Cheddar cheese"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 350 degrees F (175 degrees C). ",
      "Step 2 In a medium skillet over medium heat, brown the ground beef; drain fat.",
      "Step 3 In a medium mixing bowl, combine cream of mushroom soup, onion, milk, salt and pepper to taste.",
      "Step 4 Alternately layer the potatoes, soup mixture and meat in a 11x7 inch (2 quart) baking dish. Bake in the preheated oven for 1 to 1 1/2 hours, or until potatoes are tender. Top with Cheddar cheese, and continue baking until cheese is melted."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7127114.jpg",
    "recipeName": "Chinese Pepper Steak",
    "recipeUrl": "https://www.allrecipes.com/recipe/172704/chinese-pepper-steak/",
    "ingredients": [
      "1 pound beef top sirloin steak",
      "¼ cup soy sauce",
      "2 tablespoons white sugar",
      "2 tablespoons cornstarch",
      "½ teaspoon ground ginger",
      "3 tablespoons vegetable oil, divided",
      "1 red onion, cut into 1-inch squares",
      "1 green bell pepper, cut into 1-inch squares",
      "2 tomatoes, cut into wedges"
    ],
    "cookingInstructions": [
      "Step 1 Slice the steak into 1/2-inch thick slices across the grain. ",
      "Step 2 Whisk together soy sauce, sugar, cornstarch, and ginger in a bowl until the sugar has dissolved and the mixture is smooth. Place the steak slices into the marinade, and stir until well-coated.",
      "Step 3 Heat 1 tablespoon of vegetable oil in a wok or large skillet over medium-high heat, and place 1/3 of the steak strips into the hot oil. Cook and stir until the beef is well-browned, about 3 minutes, and remove the beef from the wok to a bowl. Repeat twice more, with the remaining beef, and set the cooked beef aside.",
      "Step 4 Return all the cooked beef to the hot wok, and stir in the onion. Toss the beef and onion together until the onion begins to soften, about 2 minutes, then stir in the green pepper. Cook and stir the mixture until the pepper has turned bright green and started to become tender, about 2 minutes, then add the tomatoes, stir everything together, and serve."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7466519.jpg",
    "recipeName": "Super Duper Slow Cooker Beef Stroganoff",
    "recipeUrl": "https://www.allrecipes.com/recipe/236867/super-duper-slow-cooker-beef-stroganoff/",
    "ingredients": [
      "1 ½ pounds cubed beef stew meat",
      "salt and ground black pepper to taste",
      "1 onion, chopped",
      "1 (10.75 ounce) can condensed cream of mushroom soup",
      "¼ cup water",
      "1 tablespoon dried chives",
      "2 cloves garlic, minced",
      "1 tablespoon Worcestershire sauce",
      "1 cube beef bouillon",
      "½ cup red wine",
      "1 tablespoon cornstarch",
      "1 tablespoon all-purpose flour",
      "1 (8 ounce) container sour cream",
      "1 (8 ounce) package sliced fresh mushrooms",
      "4 ounces cream cheese",
      "½ cup chopped fresh parsley"
    ],
    "cookingInstructions": [
      "Step 1 Spread beef stew meat into bottom of slow cooker crock; season with salt and pepper. Layer onion over the beef. Pour mushroom soup and water over the beef; add chives, garlic, Worcestershire sauce, and beef bouillon. ",
      "Step 2 Whisk red wine, cornstarch, and flour together in a small bowl; pour over the mixture in the slow cooker.",
      "Step 3 Cook on Low for 6 to 7 hours. Stir sour cream, mushrooms, cream cheese, and parsley into the beef mixture; continue cooking for 1 hour more."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6263320.jpg",
    "recipeName": "Quick Beef Stir-Fry",
    "recipeUrl": "https://www.allrecipes.com/recipe/228823/quick-beef-stir-fry/",
    "ingredients": [
      "2 tablespoons vegetable oil",
      "1 pound beef sirloin, cut into 2-inch strips",
      "1 ½ cups fresh broccoli florets",
      "1 red bell pepper, cut into matchsticks",
      "2 carrots, thinly sliced",
      "1 green onion, chopped",
      "1 teaspoon minced garlic",
      "2 tablespoons soy sauce",
      "2 tablespoons sesame seeds, toasted"
    ],
    "cookingInstructions": [
      "Step 1 Heat vegetable oil in a large wok or skillet over medium-high heat; cook and stir beef until browned, 3 to 4 minutes. Move beef to the side of the wok and add broccoli, bell pepper, carrots, green onion, and garlic to the center of the wok. Cook and stir vegetables for 2 minutes. ",
      "Step 2 Stir beef into vegetables and season with soy sauce and sesame seeds. Continue to cook and stir until vegetables are tender, about 2 more minutes."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2905812.jpg",
    "recipeName": "Easy Homemade Chili",
    "recipeUrl": "https://www.allrecipes.com/recipe/16248/easy-homemade-chili/",
    "ingredients": [
      "1 pound ground beef",
      "1 onion, chopped",
      "1 (14.5 ounce) can stewed tomatoes",
      "1 (15 ounce) can tomato sauce",
      "1 (15 ounce) can kidney beans",
      "1 ½ cups water",
      "1 pinch chili powder",
      "1 pinch garlic powder",
      "salt and pepper to taste"
    ],
    "cookingInstructions": [
      "Step 1 In a large saucepan over medium heat, combine the beef and onion and saute until meat is browned and onion is tender. Add the stewed tomatoes with juice, tomato sauce, beans and water. ",
      "Step 2 Season with the chili powder, garlic powder, salt and ground black pepper to taste. Bring to a boil, reduce heat to low, cover and let simmer for 15 minutes."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4581957.jpg",
    "recipeName": "Homemade Lasagna",
    "recipeUrl": "https://www.allrecipes.com/recipe/19344/homemade-lasagna/",
    "ingredients": [
      "1 (16 ounce) package lasagna noodles",
      "½ pound ground pork",
      "½ pound lean ground beef",
      "1 (8 ounce) can tomato sauce",
      "1 (28 ounce) can crushed tomatoes",
      "1 tablespoon chopped fresh parsley",
      "1 clove garlic, crushed",
      "½ teaspoon dried oregano",
      "½ cup minced onion",
      "⅛ teaspoon white sugar",
      "1 ½ teaspoons dried basil",
      "1 ½ teaspoons salt",
      "1 pound small curd cottage cheese",
      "3 eggs",
      "¾ cup grated Parmesan cheese",
      "2 teaspoons salt",
      "¼ teaspoon ground black pepper",
      "1 pound shredded mozzarella cheese"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 375 degrees F (190 degrees C). Bring a large pot of lightly salted water to a boil. Add noodles and cook for 8 to 10 minutes or until al dente; drain and set aside. ",
      "Step 2 Place pork and beef in a large, deep skillet. Cook over medium high heat until evenly brown. Stir in tomato sauce, crushed tomatoes, parsley, garlic, oregano, onion, sugar, basil and salt. Simmer over medium-low heat for 30 minutes, stirring occasionally.",
      "Step 3 In a large bowl, combine cottage cheese, eggs, Parmesan cheese, parsley, salt and pepper.",
      "Step 4 In a 9x13 inch baking dish, place 2 layers of noodles on the bottom of dish; layer 1/2 of the cheese mixture, 1/2 of the mozzarella cheese and 1/2 of the sauce; repeat layers.",
      "Step 5 Cover with aluminum foil and bake in preheated oven for 30 to 40 minutes. Remove foil and bake for another 5 to 10 minutes; let stand for 10 minutes before cutting; serve."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3737874.jpg",
    "recipeName": "Somali Spaghetti Sauce",
    "recipeUrl": "https://www.allrecipes.com/recipe/246489/somali-spaghetti-sauce/",
    "ingredients": [
      "2 tablespoons chopped fresh cilantro",
      "4 cloves garlic",
      "1 teaspoon cumin seeds",
      "1 teaspoon Himalayan pink salt",
      "1 teaspoon ground turmeric",
      "1 teaspoon paprika",
      "1 teaspoon Italian seasoning",
      "1 teaspoon salt-free seasoning blend (such as Mrs. Dash®)",
      "½ teaspoon ground black pepper",
      "¼ cup olive oil",
      "1 pound lean ground beef",
      "1 onion, diced",
      "1 large potato, peeled and cubed",
      "2 carrots, diced",
      "2 (14 ounce) cans diced tomatoes",
      "2 tablespoons water, or to taste (Optional)",
      "1 (16 ounce) package angel hair pasta"
    ],
    "cookingInstructions": [
      "Step 1 Place cilantro and garlic in a food processor; pulse until finely chopped. ",
      "Step 2 Toast cumin seeds in a small pot over low heat until fragrant, 2 to 3 minutes. Allow to cool, 5 minutes. Grind into a powder.",
      "Step 3 Transfer ground cumin to a small bowl. Add Himalayan pink salt, turmeric, paprika, Italian seasoning, seasoning blend, and black pepper to make seasoning mix.",
      "Step 4 Heat oil in a large pot over medium heat. Add ground beef; cook and stir until browned, about 5 minutes. Stir in 1/2 of the seasoning mix. Add onion; cook and stir until softened, about 5 minutes. Add potato and carrots. Cook, covered, stirring occasionally, until slightly softened, about 5 minutes.",
      "Step 5 Stir tomatoes into the pot and bring sauce to a boil. Reduce heat to medium-low; stir in cilantro-garlic mixture and remaining 1/2 of the seasoning mix. Simmer, stirring occasionally, until flavors combine, 30 to 40 minutes. Thin sauce with water if it seems too thick.",
      "Step 6 Bring a large pot of lightly salted water to a boil. Cook angel hair in the boiling water, stirring occasionally until tender yet firm to the bite, 4 to 5 minutes. Drain. Serve sauce over pasta."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1108799.jpg",
    "recipeName": "Classic Goulash",
    "recipeUrl": "https://www.allrecipes.com/recipe/213268/classic-goulash/",
    "ingredients": [
      "2 pounds lean ground beef",
      "2 large yellow onions, chopped",
      "3 cloves garlic, chopped",
      "3 cups water",
      "2 (15 ounce) cans tomato sauce",
      "2 (14.5 ounce) cans diced tomatoes",
      "3 tablespoons soy sauce",
      "2 tablespoons dried Italian herb seasoning",
      "3 bay leaves",
      "1 tablespoon seasoned salt, or to taste",
      "2 cups uncooked elbow macaroni"
    ],
    "cookingInstructions": [
      "Step 1 Cook and stir the ground beef in a large Dutch oven over medium-high heat, breaking the meat up as it cooks, until the meat is no longer pink and has started to brown, about 10 minutes. Skim off excess fat, and stir in the onions and garlic. Cook and stir the meat mixture until the onions are translucent, about 10 more minutes. ",
      "Step 2 Stir water, tomato sauce, diced tomatoes, soy sauce, Italian seasoning, bay leaves, and seasoned salt into the meat mixture and bring to a boil over medium heat. Reduce heat to low, cover, and simmer 20 minutes, stirring occasionally.",
      "Step 3 Stir macaroni into the mixture, cover, and simmer over low heat until the pasta is tender, about 25 minutes, stirring occasionally. Remove from heat, discard bay leaves, and serve."
    ]
  }
]