[
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6705859.jpg",
    "recipeName": "Greek Chicken Skewers",
    "recipeUrl": "https://www.allrecipes.com/recipe/273864/greek-chicken-skewers/",
    "ingredients": [
      "¼ cup lemon juice",
      "¼ cup wok oil",
      "⅛ cup red wine vinegar",
      "1 tablespoon onion flakes",
      "1 tablespoon minced garlic",
      "1 lemon, zested",
      "1 teaspoon Greek seasoning",
      "1 teaspoon poultry seasoning",
      "1 teaspoon dried oregano",
      "1 teaspoon ground black pepper",
      "½ teaspoon dried thyme",
      "3 skinless, boneless chicken breasts, or as needed, cut into 1-inch pieces",
      "8 bamboo skewers, or as needed, soaked in water for 30 minutes"
    ],
    "cookingInstructions": [
      "Step 1 Whisk lemon juice, oil, vinegar, onion flakes, garlic, lemon zest, Greek seasoning, poultry seasoning, oregano, pepper, and thyme together in a bowl and pour into a resealable plastic bag. ",
      "Step 2 Add chicken, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for at least 2 hours.",
      "Step 3 Preheat the oven to 350 degrees F (175 degrees C).",
      "Step 4 Remove chicken from the marinade and shake off excess; thread onto skewers. Discard the remaining marinade. Place the skewers on a baking sheet.",
      "Step 5 Roast in the preheated oven until golden brown, about 20 minutes."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8125095.jpg",
    "recipeName": "French Onion-Breaded Baked Chicken",
    "recipeUrl": "https://www.allrecipes.com/recipe/280018/french-onion-breaded-baked-chicken/",
    "ingredients": [
      "1 cup bread crumbs",
      "1 (1 ounce) package dry French onion soup mix",
      "⅓ cup mayonnaise",
      "1 tablespoon garlic paste (Optional)",
      "4 skinless, boneless chicken breasts"
    ],
    "cookingInstructions": [
      "Step 1 Preheat the oven to 425 degrees F (220 degrees C). ",
      "Step 2 Mix bread crumbs and dry soup mix together in a bowl.",
      "Step 3 Mix mayonnaise and garlic paste together in a separate bowl. Microwave on high to thin out consistency, 20 to 30 seconds.",
      "Step 4 Brush chicken breasts with the mayonnaise mixture. Cover with the crumb mixture. Place on a baking sheet.",
      "Step 5 Bake on the middle rack of the preheated oven until chicken is no longer pink in the center and juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8031915.jpg",
    "recipeName": "Air Fryer Apricot-Glazed Chicken Breasts",
    "recipeUrl": "https://www.allrecipes.com/recipe/279934/air-fryer-apricot-glazed-chicken-breasts/",
    "ingredients": [
      "3 tablespoons apricot preserves",
      "1 teaspoon fresh ginger paste (such as Gourmet Garden™)",
      "½ teaspoon minced fresh rosemary",
      "2 (8 ounce) boneless, skinless chicken breasts",
      "1 teaspoon vegetable oil",
      "salt and ground black pepper to taste"
    ],
    "cookingInstructions": [
      "Step 1 Stir apricot preserves, ginger paste, and rosemary together in a small bowl. Microwave for about 20 seconds to make preserves easier to spread. ",
      "Step 2 Pound chicken breasts to uniform thickness and pat dry with a paper towel. Rub with oil and season with salt and pepper.",
      "Step 3 Preheat the air fryer to 400 degrees F (200 degrees C). Spray the basket with cooking spray and add chicken breasts in a single layer.",
      "Step 4 Air fry for 4 minutes. Flip and rotate the position of the chicken breasts. Brush with the apricot mixture. Return basket to the air fryer and cook until chicken is no longer pink in the center and the juices run clear, 8 to 12 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
      "Step 5 Transfer chicken to a plate, cover loosely with aluminum foil, and let sit for 5 minutes. Cut chicken breasts into slices and serve."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8046982.jpg",
    "recipeName": "Sheet Pan Sweet and Sour Chicken",
    "recipeUrl": "https://www.allrecipes.com/recipe/279987/sheet-pan-sweet-and-sour-chicken/",
    "ingredients": [
      "2 (8 ounce) cans pineapple tidbits in juice",
      "1 red bell pepper, seeded and cut into 1-inch pieces",
      "1 green bell pepper, seeded and cut into 1-inch pieces",
      "1 carrot, peeled and sliced diagonally",
      "½ red onion, cut into 1-inch pieces",
      "3 tablespoons avocado oil",
      "salt and ground black pepper to taste",
      "1 ½ pounds skinless, boneless chicken breast, cut into 1-inch pieces",
      "water as needed",
      "2 tablespoons cornstarch",
      "½ cup light brown sugar",
      "⅓ cup rice vinegar",
      "3 tablespoons ketchup",
      "3 tablespoons soy sauce",
      "1 tablespoon chile-garlic sauce",
      "1 tablespoon ginger-garlic paste",
      "⅛ teaspoon ground white pepper"
    ],
    "cookingInstructions": [
      "Step 1 Preheat the oven to 425 degrees F (220 degrees C). ",
      "Step 2 Drain pineapple tidbits and place juice into a 1-cup liquid measure. Place drained pineapple in a large mixing bowl; set aside.",
      "Step 3 Add bell peppers, carrot, and onion to the pineapple tidbits. Pour 2 tablespoons avocado oil over top and sprinkle with salt and pepper. Stir until coated with oil and seasoning, then spread in a single layer on a sheet pan. Place chicken into the same bowl, drizzle with remaining 1 tablespoon oil, and season with salt and pepper. Toss to coat and nestle chicken pieces on the sheet pan between the pineapple and vegetable pieces.",
      "Step 4 Bake in the preheated oven until vegetables are tender and chicken is cooked through, about 25 minutes.",
      "Step 5 Meanwhile, add enough water to the reserved pineapple juice to make 1 cup liquid. Transfer 3 tablespoons of the liquid to a small bowl and add cornstarch. Stir with a fork or whisk until smooth.",
      "Step 6 Pour remaining liquid into a saucepan with brown sugar, rice vinegar, ketchup, soy sauce, chile-garlic sauce, ginger-garlic paste, and white pepper. Bring to a boil, stirring occasionally, over medium-high heat. Slowly add cornstarch mixture, whisking briskly. Return to a boil and allow to thicken, whisking constantly, about 1 minute.",
      "Step 7 Drizzle chicken, pineapple, and vegetables with sauce to serve."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8089393.jpg",
    "recipeName": "Broiled Paprika and Lemon-Pepper Chicken Breasts",
    "recipeUrl": "https://www.allrecipes.com/recipe/279909/broiled-paprika-and-lemon-pepper-chicken-breasts/",
    "ingredients": [
      "2 ½ tablespoons extra-virgin olive oil, divided",
      "2 skinless, boneless chicken breast halves",
      "2 tablespoons paprika",
      "1 tablespoon lemon-pepper seasoning",
      "1 tablespoon kosher salt",
      "2 cloves garlic, smashed and finely chopped",
      "½ medium onion, chopped"
    ],
    "cookingInstructions": [
      "Step 1 Set an oven rack about 6 inches from the heat source and preheat the oven\u0027s broiler. Grease a broiler pan with 1/2 tablespoon olive oil. ",
      "Step 2 Rinse chicken breasts and pat dry. Brush with remaining olive oil until coated. Sprinkle each piece evenly on both sides with paprika, lemon-pepper, and salt. Place on the prepared broiler pan, sprinkle garlic over top, and sprinkle onions around the base of the chicken, with several smaller pieces on top.",
      "Step 3 Cook under the preheated broiler for 5 minutes. Flip and continue to cook, checking often, until no longer pink in the center and the juices run clear, 5 to 10 more minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1098038.jpg",
    "recipeName": "Anne\u0027s Chicken Chilaquiles Rojas",
    "recipeUrl": "https://www.allrecipes.com/recipe/279677/annes-chicken-chilaquiles-rojas/",
    "ingredients": [
      "1 (28 ounce) can whole peeled tomatoes, drained",
      "2 chipotle chiles in adobo sauce, or more to taste",
      "1 ½ tablespoons vegetable oil",
      "1 large white onion, thinly sliced",
      "3 cloves garlic, minced",
      "1 ½ cups chicken broth",
      "1 dash roasted ground cumin",
      "1 dash dried oregano",
      "salt and ground black pepper to taste",
      "1 (16 ounce) package tortilla chips",
      "1 (8 ounce) package shredded Mexican cheese blend",
      "5 ounces crumbled cotija cheese",
      "1 whole cooked chicken, deboned and shredded",
      "⅔ cup chopped green onions, divided",
      "1 cup chopped cilantro, divided",
      "1 (8 ounce) carton sour cream, divided"
    ],
    "cookingInstructions": [
      "Step 1 Preheat the oven to 350 degrees F (175 degrees C). Grease a large (10x15-inch) casserole dish. ",
      "Step 2 Combine drained tomatoes and chipotle chiles in adobo in a blender and puree until smooth.",
      "Step 3 Heat oil in a large skillet over medium heat. Saute onion in hot oil until brown, 5 to 7 minutes. Add garlic and saute 1 minute more. Add pureed tomato-chile sauce and simmer until mixture starts to thicken. Pour in chicken broth and stir in cumin, oregano, and salt; let simmer until mixture thickens. Remove from heat.",
      "Step 4 Mix tortilla chips and tomato-chile sauce, folding carefully to cover chips completely. You may have to do this in 2 batches.",
      "Step 5 Cover the bottom of the casserole dish with half of the chip/sauce mixture. Sprinkle a layer of Mexican cheese and cotija cheese over top. Add shredded chicken to cover all of the chips and cheese. Season chicken with salt and pepper, then sprinkle with 1/2 of the green onions and 1/2 of the cilantro. Spoon 3/4 of the sour cream evenly over top. Spread with the remaining tortilla mixture then top with remaining Mexican and cotija cheeses. Cover with aluminum foil.",
      "Step 6 Bake in the preheated oven until mixture is bubbly and cheese is melted, 35 to 45 minutes. Remove from the oven and let sit for 5 minutes. Serve with sour cream, green onions, and cilantro."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7999248.jpg",
    "recipeName": "Pollo alla Birra for Two",
    "recipeUrl": "https://www.allrecipes.com/recipe/279648/pollo-alla-birra-for-two/",
    "ingredients": [
      "2 skinless chicken leg quarters",
      "1 large clove garlic, crushed",
      "2 tablespoons dried rosemary, divided",
      "salt and freshly ground pepper to taste",
      "1 cup beer",
      "3 tablespoons cornstarch",
      "3 tablespoons olive oil",
      "1 medium yellow onion, halved and cut into 1/4-inch-thick slices"
    ],
    "cookingInstructions": [
      "Step 1 Put the chicken in a large bowl with crushed garlic, 1 tablespoon rosemary, salt, and pepper. Pour beer over top and let rest for at least 30 minutes. ",
      "Step 2 Remove chicken from the marinade and pat dry with paper towels. Sprinkle cornstarch over the chicken to coat it completely. Reserve the marinade.",
      "Step 3 Heat oil in a Dutch oven over medium heat. Add chicken and brown on all sides, about 3 minutes per side. Add onion. Remove garlic from the marinade and add to the Dutch oven with a bit of marinade to keep everything from burning. Saute until onion is tender and translucent, about 5 minutes.",
      "Step 4 Add remaining marinade and remaining 1 tablespoon rosemary. Scrape the bottom of the pot to remove any browned bits. Lower the heat and simmer until the sauce has reduced and thickened and the chicken is no longer pink inside, about 15 minutes. Serve hot."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7980195.jpg",
    "recipeName": "Make-Ahead Freezer Chicken Parmesan",
    "recipeUrl": "https://www.allrecipes.com/recipe/279629/make-ahead-freezer-chicken-parmesan/",
    "ingredients": [
      "1 pound skinless, boneless chicken breast halves",
      "1 large egg, beaten",
      "⅓ cup bread crumbs",
      "2 tablespoons grated Parmesan cheese",
      "¾ teaspoon Italian seasoning",
      "½ teaspoon garlic powder",
      "1 (8 ounce) can tomato sauce",
      "¾ cup shredded mozzarella cheese"
    ],
    "cookingInstructions": [
      "Step 1 Preheat the oven to 375 degrees F (190 degrees C). Grease a baking sheet. ",
      "Step 2 Pound chicken breasts to 1/2-inch thickness or less.",
      "Step 3 Place beaten egg in a bowl. Combine bread crumbs, Parmesan cheese, Italian seasoning, and garlic powder in another bowl. Dip each chicken breast in egg, then roll in bread crumb mixture to coat evenly. Place on the prepared baking sheet.",
      "Step 4 Bake in the preheated oven for 10 minutes. Turn and continue to cook until chicken is no longer pink in the center and juices run clear, about 10 minutes more. Let cool, 20 to 30 minutes.",
      "Step 5 Freeze in a 1-gallon resealable bag with smaller bags of tomato sauce and mozzarella cheese.",
      "Step 6 To serve: Thaw in the refrigerator overnight. Reheat chicken at 375 degrees F (190 degrees C) until heated through and crispy, 15 to 20 minutes. Top chicken with tomato sauce, sprinkle with mozzarella cheese, and bake until cheese is melted, an additional 3 minutes."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F389250.jpg",
    "recipeName": "Juicy Roasted Chicken",
    "recipeUrl": "https://www.allrecipes.com/recipe/83557/juicy-roasted-chicken/",
    "ingredients": [
      "1 (3 pound) whole chicken, giblets removed",
      "salt and black pepper to taste",
      "1 tablespoon onion powder, or to taste",
      "½ cup margarine, divided",
      "1 stalk celery, leaves removed"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 350 degrees F (175 degrees C). ",
      "Step 2 Place chicken in a roasting pan, and season generously inside and out with salt and pepper. Sprinkle inside and out with onion powder. Place 3 tablespoons margarine in the chicken cavity. Arrange dollops of the remaining margarine around the chicken\u0027s exterior. Cut the celery into 3 or 4 pieces, and place in the chicken cavity.",
      "Step 3 Bake uncovered 1 hour and 15 minutes in the preheated oven, to a minimum internal temperature of 180 degrees F (82 degrees C). Remove from heat, and baste with melted margarine and drippings. Cover with aluminum foil, and allow to rest about 30 minutes before serving."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3095600.jpg",
    "recipeName": "Buffalo Chicken Dip",
    "recipeUrl": "https://www.allrecipes.com/recipe/68461/buffalo-chicken-dip/",
    "ingredients": [
      "2 (10 ounce) cans chunk chicken, drained",
      "2 (8 ounce) packages cream cheese, softened",
      "1 cup Ranch dressing",
      "¾ cup pepper sauce (such as Frank\u0027s Red Hot®)",
      "1 ½ cups shredded Cheddar cheese",
      "1 bunch celery, cleaned and cut into 4 inch pieces",
      "1 (8 ounce) box chicken-flavored crackers"
    ],
    "cookingInstructions": [
      "Step 1 Heat chicken and hot sauce in a skillet over medium heat, until heated through. Stir in cream cheese and ranch dressing. Cook, stirring until well blended and warm. Mix in half of the shredded cheese, and transfer the mixture to a slow cooker. Sprinkle the remaining cheese over the top, cover, and cook on Low setting until hot and bubbly. Serve with celery sticks and crackers. "
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3455742.jpg",
    "recipeName": "Baked Chicken Schnitzel",
    "recipeUrl": "https://www.allrecipes.com/recipe/244950/baked-chicken-schnitzel/",
    "ingredients": [
      "1 tablespoon olive oil, or as desired",
      "6 chicken breasts, cut in half lengthwise (butterflied)",
      "salt and ground black pepper to taste",
      "¾ cup all-purpose flour",
      "1 tablespoon paprika",
      "2 eggs, beaten",
      "2 cups seasoned bread crumbs",
      "1 large lemon, zested"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 425 degrees F (220 degrees C). Line a large baking sheet with aluminum foil and drizzle olive oil over foil. Place baking sheet in preheated oven. ",
      "Step 2 Flatten chicken breasts so they are all about 1/4-inch thick. Season chicken with salt and pepper.",
      "Step 3 Mix flour and paprika together on a large plate. Beat eggs with salt and pepper in a shallow bowl. Mix bread crumbs and lemon zest together on a separate large plate. Dredge each chicken piece in flour mixture, then egg, and then bread crumbs mixture and set aside in 1 layer on a clean plate. Repeat with remaining chicken.",
      "Step 4 Remove baking sheet from oven and arrange chicken in 1 layer on the sheet. Drizzle more olive oil over each piece of coated chicken.",
      "Step 5 Bake in the preheated oven for 5 to 6 minutes. Flip chicken and continue baking until no longer pink in the center and the breading is lightly browned, 5 to 6 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6635156.jpg",
    "recipeName": "Chicken Parmesan",
    "recipeUrl": "https://www.allrecipes.com/recipe/223042/chicken-parmesan/",
    "ingredients": [
      "4 skinless, boneless chicken breast halves",
      "salt and freshly ground black pepper to taste",
      "2 eggs",
      "1 cup panko bread crumbs, or more as needed",
      "½ cup grated Parmesan cheese",
      "2 tablespoons all-purpose flour, or more if needed",
      "1 cup olive oil for frying",
      "½ cup prepared tomato sauce",
      "¼ cup fresh mozzarella, cut into small cubes",
      "¼ cup chopped fresh basil",
      "½ cup grated provolone cheese",
      "¼ cup grated Parmesan cheese",
      "1 tablespoon olive oil"
    ],
    "cookingInstructions": [
      "Step 1 Preheat an oven to 450 degrees F (230 degrees C). ",
      "Step 2 Place chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1/2-inch. Season chicken thoroughly with salt and pepper.",
      "Step 3 Beat eggs in a shallow bowl and set aside.",
      "Step 4 Mix bread crumbs and 1/2 cup Parmesan cheese in a separate bowl, set aside.",
      "Step 5 Place flour in a sifter or strainer; sprinkle over chicken breasts, evenly coating both sides.",
      "Step 6 Dip flour coated chicken breast in beaten eggs. Transfer breast to breadcrumb mixture, pressing the crumbs into both sides. Repeat for each breast. Set aside breaded chicken breasts for about 15 minutes.",
      "Step 7 Heat 1 cup olive oil in a large skillet on medium-high heat until it begins to shimmer. Cook chicken until golden, about 2 minutes on each side. The chicken will finish cooking in the oven.",
      "Step 8 Place chicken in a baking dish and top each breast with about 1/3 cup of tomato sauce. Layer each chicken breast with equal amounts of mozzarella cheese, fresh basil, and provolone cheese. Sprinkle 1 to 2 tablespoons of Parmesan cheese on top and drizzle with 1 tablespoon olive oil.",
      "Step 9 Bake in the preheated oven until cheese is browned and bubbly, and chicken breasts are no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4535759.jpg",
    "recipeName": "Chicken Pot Pie IX",
    "recipeUrl": "https://www.allrecipes.com/recipe/26317/chicken-pot-pie-ix/",
    "ingredients": [
      "1 pound skinless, boneless chicken breast halves - cubed",
      "1 cup sliced carrots",
      "1 cup frozen green peas",
      "½ cup sliced celery",
      "⅓ cup butter",
      "⅓ cup chopped onion",
      "⅓ cup all-purpose flour",
      "½ teaspoon salt",
      "¼ teaspoon black pepper",
      "¼ teaspoon celery seed",
      "1 ¾ cups chicken broth",
      "⅔ cup milk",
      "2 (9 inch) unbaked pie crusts"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 425 degrees F (220 degrees C.) ",
      "Step 2 In a saucepan, combine chicken, carrots, peas, and celery. Add water to cover and boil for 15 minutes. Remove from heat, drain and set aside.",
      "Step 3 In the saucepan over medium heat, cook onions in butter until soft and translucent. Stir in flour, salt, pepper, and celery seed. Slowly stir in chicken broth and milk. Simmer over medium-low heat until thick. Remove from heat and set aside.",
      "Step 4 Place the chicken mixture in bottom pie crust. Pour hot liquid mixture over. Cover with top crust, seal edges, and cut away excess dough. Make several small slits in the top to allow steam to escape.",
      "Step 5 Bake in the preheated oven for 30 to 35 minutes, or until pastry is golden brown and filling is bubbly. Cool for 10 minutes before serving."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6269062.jpg",
    "recipeName": "Winter Chicken Bake",
    "recipeUrl": "https://www.allrecipes.com/recipe/157872/winter-chicken-bake/",
    "ingredients": [
      "1 sweet potato",
      "½ medium sweet onion, chopped",
      "1 medium apple - peeled, cored, and chopped",
      "3 carrots, peeled and chopped",
      "2 skinless, boneless chicken breast halves",
      "2 tablespoons barbecue sauce",
      "1 cup cranberries"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 375 degrees F (190 degrees C). Lightly grease a baking dish. ",
      "Step 2 Pierce the sweet potato several times with a fork and cut in half. Place in a microwave-safe dish; pour water to about 1/2-inch deep. Cook in microwave 10 minutes.",
      "Step 3 Arrange the onion, apple, and carrots into the bottom of the prepared baking dish. Brush the barbecue sauce on both sides of the chicken breasts and lay atop the vegetables. Peel the sweet potato and cut into large chunks; scatter into the baking dish. Sprinkle the cranberries over the dish.",
      "Step 4 Bake in the preheated oven until the chicken is tender and no longer pink in the center, 45 to 55 minutes. Allow to cool 5 minutes before serving."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1011047.jpg",
    "recipeName": "Aussie Chicken",
    "recipeUrl": "https://www.allrecipes.com/recipe/18775/aussie-chicken/",
    "ingredients": [
      "4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness",
      "2 teaspoons seasoning salt",
      "6 slices bacon, cut in half",
      "½ cup prepared yellow mustard",
      "½ cup honey",
      "¼ cup light corn syrup",
      "¼ cup mayonnaise",
      "1 tablespoon dried onion flakes",
      "1 tablespoon vegetable oil",
      "1 cup sliced fresh mushrooms",
      "2 cups shredded Colby-Monterey Jack cheese",
      "2 tablespoons chopped fresh parsley"
    ],
    "cookingInstructions": [
      "Step 1 Rub the chicken breasts with the seasoning salt, cover and refrigerate for 30 minutes. ",
      "Step 2 Preheat oven to 350 degrees F (175 degrees C). Place bacon in a large, deep skillet. Cook over medium high heat until crisp. Set aside.",
      "Step 3 In a medium bowl, combine the mustard, honey, corn syrup, mayonnaise and dried onion flakes. Remove half of sauce, cover and refrigerate to serve later.",
      "Step 4 Heat oil in a large skillet over medium heat. Place the breasts in the skillet and saute for 3 to 5 minutes per side, or until browned. Remove from skillet and place the breasts into a 9x13 inch baking dish. Apply the honey mustard sauce to each breast, then layer each breast with mushrooms and bacon. Sprinkle top with shredded cheese.",
      "Step 5 Bake in preheated oven for 15 minutes, or until cheese is melted and chicken juices run clear. Garnish with parsley and serve with the reserved honey mustard sauce."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1040851.jpg",
    "recipeName": "Mamaw\u0027s Chicken and Rice Casserole",
    "recipeUrl": "https://www.allrecipes.com/recipe/233983/mamaws-chicken-and-rice-casserole/",
    "ingredients": [
      "3 chicken breasts, cut into cubes",
      "2 cups water",
      "2 cups instant white rice",
      "1 (10.75 ounce) can cream of chicken soup",
      "1 (10.75 ounce) can cream of celery soup",
      "1 (10.75 ounce) can cream of mushroom soup",
      "salt and ground black pepper to taste",
      "½ cup butter, sliced into pats"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 400 degrees F (200 degrees C). Grease sides and bottom of a casserole dish. ",
      "Step 2 Stir chicken, water, rice, cream of chicken soup, cream of celery soup, and cream of mushroom soup together in the prepared casserole dish; season with salt and pepper. Arrange butter evenly over the top of the chicken mixture.",
      "Step 3 Bake in preheated oven until the rice is tender and the chicken is cooked through, 1 hour to 75 minutes. Cool 15 minutes before serving."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8692236.jpg",
    "recipeName": "Honey-Garlic Chicken Thighs",
    "recipeUrl": "https://www.allrecipes.com/recipe/282124/honey-garlic-chicken-thighs/",
    "ingredients": [
      "8 (5 ounce) boneless chicken thighs",
      "salt and ground black pepper to taste",
      "2 tablespoons olive oil, or as needed",
      "½ medium onion, finely chopped",
      "7 cloves garlic, chopped, or to taste",
      "1 cup honey",
      "½ cup soy sauce",
      "1 pinch onion powder, or to taste",
      "1 pinch garlic powder, or to taste",
      "¼ cup chopped fresh cilantro"
    ],
    "cookingInstructions": [
      "Step 1 Season the chicken on both sides with salt and pepper. ",
      "Step 2 Cover the bottom of a cast iron skillet with olive oil and bring to medium-high heat. Add chicken and brown on one side, 3 to 5 minutes. Flip chicken, and add onion and garlic; continue to cook until chicken is mostly (but not fully) cooked and onion and garlic are soft, 5 to 7 minutes more. Remove chicken to a plate.",
      "Step 3 Add honey, soy sauce, onion powder, garlic powder, and onion powder to the skillet. Stir and scrape the bottom of the pan with a wooden spoon to get the garlic and onion to mix with the liquid.",
      "Step 4 Put chicken back into the pan, cover, and reduce heat to medium. Cook until no longer pink in the center and juices run clear, about 10 more minutes, turning once halfway through. An instant-read thermometer inserted into the center of a thigh should read at least 165 degrees F (74 degrees C).",
      "Step 5 Place on a serving tray and drizzle liquid from the pan on top. Sprinkle with chopped cilantro before serving."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4530047.jpg",
    "recipeName": "Baked Teriyaki Chicken",
    "recipeUrl": "https://www.allrecipes.com/recipe/9023/baked-teriyaki-chicken/",
    "ingredients": [
      "1 tablespoon cornstarch",
      "1 tablespoon cold water",
      "½ cup white sugar",
      "½ cup soy sauce",
      "¼ cup cider vinegar",
      "1 clove garlic, minced",
      "½ teaspoon ground ginger",
      "¼ teaspoon ground black pepper",
      "12 skinless chicken thighs"
    ],
    "cookingInstructions": [
      "Step 1 In a small saucepan over low heat, combine the cornstarch, cold water, sugar, soy sauce, vinegar, garlic, ginger and ground black pepper. Let simmer, stirring frequently, until sauce thickens and bubbles. ",
      "Step 2 Preheat oven to 425 degrees F (220 degrees C).",
      "Step 3 Place chicken pieces in a lightly greased 9x13 inch baking dish. Brush chicken with the sauce. Turn pieces over, and brush again.",
      "Step 4 Bake in the preheated oven for 30 minutes. Turn pieces over, and bake for another 30 minutes, until no longer pink and juices run clear. Brush with sauce every 10 minutes during cooking."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5099803.jpg",
    "recipeName": "Day Before Pay Day Fried Rice",
    "recipeUrl": "https://www.allrecipes.com/recipe/125394/day-before-pay-day-fried-rice/",
    "ingredients": [
      "3 tablespoons vegetable oil, divided",
      "3 eggs, beaten",
      "3 cups cold, cooked white rice",
      "2 cups chopped cooked chicken",
      "½ cup sliced celery",
      "½ cup shredded carrot",
      "1 cup frozen green peas, thawed",
      "2 green onions, sliced",
      "3 tablespoons soy sauce"
    ],
    "cookingInstructions": [
      "Step 1 Heat 1 tablespoon of oil in a wok or large skillet over medium-high heat. Pour in the eggs; cook and stir until scrambled and firm. Remove from wok, and set aside. ",
      "Step 2 Put remaining 2 tablespoons of oil in the wok and turn heat up to high. Stir in rice until each grain is coated with oil. Stir in chicken, celery, carrot, peas and green onions. Reduce heat to medium, cover and allow to steam for 5 minutes. Stir in scrambled eggs and soy sauce, and cook until eggs are heated through."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F546203.jpg",
    "recipeName": "Easy Slow Cooker Chicken Wings",
    "recipeUrl": "https://www.allrecipes.com/recipe/24791/easy-slow-cooker-chicken-wings/",
    "ingredients": [
      "5 ½ pounds chicken wings, split and tips discarded",
      "1 (12 fluid ounce) can or bottle chile sauce",
      "¼ cup fresh lemon juice",
      "¼ cup molasses",
      "2 tablespoons Worcestershire sauce",
      "3 drops hot pepper sauce",
      "1 tablespoon salsa",
      "2 ½ teaspoons chili powder",
      "1 teaspoon garlic powder",
      "2 teaspoons salt"
    ],
    "cookingInstructions": [
      "Step 1 Place chicken in slow cooker. In a medium bowl combine the chile sauce, lemon juice, molasses, Worcestershire sauce, hot pepper sauce, salsa, chili powder, garlic powder and salt. Mix together and pour mixture over chicken. ",
      "Step 2 Cook in slow cooker on Medium Low setting for 5 hours."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6819226.jpg",
    "recipeName": "Grilled Bacon-Wrapped Chicken Tenders",
    "recipeUrl": "https://www.allrecipes.com/recipe/274735/grilled-bacon-wrapped-chicken-tenders/",
    "ingredients": [
      "8 chicken tenders",
      "1 tablespoon BBQ rub (such as McCormick®)",
      "8 slices center-cut bacon, cut in half lengthwise",
      "2 tablespoons honey",
      "1 teaspoon water"
    ],
    "cookingInstructions": [
      "Step 1 Preheat an outdoor grill for medium heat and lightly oil the grate. ",
      "Step 2 Season chicken tenders with BBQ rub. Wrap each tender with 2 thin strips of bacon, tucking in the ends to secure.",
      "Step 3 Mix together honey and water in a small bowl. Set aside.",
      "Step 4 Place chicken tenders on the preheated grill and reduce heat to medium-low. Close lid and grill tenders, turning every 2 to 3 minutes, until bacon is browned and chicken has reached an internal temperature of 165 degrees Fahrenheit (73 degrees C), 12 to 14 minutes. For crispier bacon, increase heat during the last 2 minutes of cooking.",
      "Step 5 Move tenders to indirect heat and brush with honey mixture. Transfer to a plate and serve."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3508202.jpg",
    "recipeName": "Chicken Cordon Bleu I",
    "recipeUrl": "https://www.allrecipes.com/recipe/8495/chicken-cordon-bleu-i/",
    "ingredients": [
      "4 skinless, boneless chicken breast halves",
      "¼ teaspoon salt",
      "⅛ teaspoon ground black pepper",
      "6 slices Swiss cheese",
      "4 slices cooked ham",
      "½ cup seasoned bread crumbs"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 350 degrees F (175 degrees C). Coat a 7x11 inch baking dish with nonstick cooking spray. ",
      "Step 2 Pound chicken breasts to 1/4 inch thickness.",
      "Step 3 Sprinkle each piece of chicken on both sides with salt and pepper. Place 1 cheese slice and 1 ham slice on top of each breast. Roll up each breast, and secure with a toothpick. Place in baking dish, and sprinkle chicken evenly with bread crumbs.",
      "Step 4 Bake for 30 to 35 minutes, or until chicken is no longer pink. Remove from oven, and place 1/2 cheese slice on top of each breast. Return to oven for 3 to 5 minutes, or until cheese has melted. Remove toothpicks, and serve immediately."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F17638.jpg",
    "recipeName": "Homemade Chicken Soup",
    "recipeUrl": "https://www.allrecipes.com/recipe/8814/homemade-chicken-soup/",
    "ingredients": [
      "1 (3 pound) whole chicken",
      "4 carrots, halved",
      "4 stalks celery, halved",
      "1 large onion, halved",
      "water to cover",
      "salt and pepper to taste",
      "1 teaspoon chicken bouillon granules (Optional)"
    ],
    "cookingInstructions": [
      "Step 1 Put the chicken, carrots, celery and onion in a large soup pot and cover with cold water. Heat and simmer, uncovered, until the chicken meat falls off of the bones (skim off foam every so often). ",
      "Step 2 Take everything out of the pot. Strain the broth. Pick the meat off of the bones and chop the carrots, celery and onion. Season the broth with salt, pepper and chicken bouillon to taste, if desired. Return the chicken, carrots, celery and onion to the pot, stir together, and serve."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4465974.jpg",
    "recipeName": "Indian Chicken Curry (Murgh Kari)",
    "recipeUrl": "https://www.allrecipes.com/recipe/212721/indian-chicken-curry-murgh-kari/",
    "ingredients": [
      "2 pounds skinless, boneless chicken breast halves",
      "2 teaspoons salt",
      "½ cup cooking oil",
      "1 ½ cups chopped onion",
      "1 tablespoon minced garlic",
      "1 ½ teaspoons minced fresh ginger root",
      "1 tablespoon curry powder",
      "1 teaspoon ground cumin",
      "1 teaspoon ground turmeric",
      "1 teaspoon ground coriander",
      "1 teaspoon cayenne pepper",
      "1 tablespoon water",
      "1 (15 ounce) can crushed tomatoes",
      "1 cup plain yogurt",
      "1 tablespoon chopped fresh cilantro",
      "1 teaspoon salt",
      "½ cup water",
      "1 teaspoon garam masala",
      "1 tablespoon chopped fresh cilantro",
      "1 tablespoon fresh lemon juice"
    ],
    "cookingInstructions": [
      "Step 1 Sprinkle the chicken breasts with 2 teaspoons salt. ",
      "Step 2 Heat the oil in a large skillet over high heat; partially cook the chicken in the hot oil in batches until completely browned. Transfer the browned chicken breasts to a plate and set aside.",
      "Step 3 Reduce the heat under the skillet to medium-high; add the onion, garlic, and ginger to the oil remaining in the skillet and cook and stir until the onion turns translucent, about 8 minutes. Stir the curry powder, cumin, turmeric, coriander, cayenne, and 1 tablespoon of water into the onion mixture; allow to heat together for about 1 minute while stirring. Mix the tomatoes, yogurt, 1 tablespoon chopped cilantro, and 1 teaspoon salt into the mixture. Return the chicken breast to the skillet along with any juices on the plate. Pour 1/2 cup water into the mixture; bring to a boil, turning the chicken to coat with the sauce. Sprinkle the garam masala and 1 tablespoon cilantro over the chicken.",
      "Step 4 Cover the skillet and simmer until the chicken breasts are no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Sprinkle with lemon juice to serve."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F806223.jpg",
    "recipeName": "Slow Cooker Chicken and Dumplings",
    "recipeUrl": "https://www.allrecipes.com/recipe/8941/slow-cooker-chicken-and-dumplings/",
    "ingredients": [
      "4 skinless, boneless chicken breast halves",
      "2 tablespoons butter",
      "2 (10.75 ounce) cans condensed cream of chicken soup",
      "1 onion, finely diced",
      "2 (10 ounce) packages refrigerated biscuit dough, torn into pieces"
    ],
    "cookingInstructions": [
      "Step 1 Place the chicken, butter, soup, and onion in a slow cooker, and fill with enough water to cover. ",
      "Step 2 Cover, and cook for 5 to 6 hours on High. About 30 minutes before serving, place the torn biscuit dough in the slow cooker. Cook until the dough is no longer raw in the center."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7160159.jpg",
    "recipeName": "Chicken Tortilla Soup I",
    "recipeUrl": "https://www.allrecipes.com/recipe/13351/chicken-tortilla-soup-i/",
    "ingredients": [
      "1 onion, chopped",
      "3 cloves garlic, minced",
      "1 tablespoon olive oil",
      "2 teaspoons chili powder",
      "1 teaspoon dried oregano",
      "1 (28 ounce) can crushed tomatoes",
      "1 (10.5 ounce) can condensed chicken broth",
      "1 ¼ cups water",
      "1 cup whole corn kernels, cooked",
      "1 cup white hominy",
      "1 (4 ounce) can chopped green chile peppers",
      "1 (15 ounce) can black beans, rinsed and drained",
      "¼ cup chopped fresh cilantro",
      "2 boneless chicken breast halves, cooked and cut into bite-sized pieces",
      "crushed tortilla chips",
      "sliced avocado",
      "shredded Monterey Jack cheese",
      "chopped green onions"
    ],
    "cookingInstructions": [
      "Step 1 In a medium stock pot, heat oil over medium heat. Saute onion and garlic in oil until soft. Stir in chili powder, oregano, tomatoes, broth, and water. Bring to a boil, and simmer for 5 to 10 minutes. ",
      "Step 2 Stir in corn, hominy, chiles, beans, cilantro, and chicken. Simmer for 10 minutes.",
      "Step 3 Ladle soup into individual serving bowls, and top with crushed tortilla chips, avocado slices, cheese, and chopped green onion."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F10%2F07%2F272858.jpg",
    "recipeName": "Air Fryer Chicken Thighs",
    "recipeUrl": "https://www.allrecipes.com/recipe/272858/air-fryer-chicken-thighs/",
    "ingredients": [
      "4 skin-on, boneless chicken thighs",
      "2 teaspoons extra-virgin olive oil",
      "1 teaspoon smoked paprika",
      "¾ teaspoon garlic powder",
      "½ teaspoon salt",
      "½ teaspoon ground black pepper"
    ],
    "cookingInstructions": [
      "Step 1 Preheat an air fryer to 400 degrees F (200 degrees C). ",
      "Step 2 Pat chicken thighs dry with a paper towel and brush the skin-side of each piece with olive oil. Place chicken thighs, skin-side down, in a single layer on a plate.",
      "Step 3 Combine smoked paprika, garlic powder, salt, and pepper in a bowl and sprinkle half the seasoning mixture evenly over the 4 chicken thighs. Turn thighs over and evenly sprinkle remaining seasoning mixture on top. Place chicken thighs in the air fryer basket in a single layer, skin-side up.",
      "Step 4 Fry in the preheated air fryer until chicken is brown and juices run clear, about 18 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4496634.jpg",
    "recipeName": "Baked Chicken Wings",
    "recipeUrl": "https://www.allrecipes.com/recipe/187822/baked-chicken-wings/",
    "ingredients": [
      "3 tablespoons olive oil",
      "3 cloves garlic, pressed",
      "2 teaspoons chili powder",
      "1 teaspoon garlic powder",
      "salt and ground black pepper to taste",
      "10 chicken wings"
    ],
    "cookingInstructions": [
      "Step 1 Preheat the oven to 375 degrees F (190 degrees C). ",
      "Step 2 Combine the olive oil, garlic, chili powder, garlic powder, salt, and pepper in a large, resealable bag; seal and shake to combine. Add the chicken wings; reseal and shake to coat. Arrange the chicken wings on a baking sheet.",
      "Step 3 Cook the wings in the preheated oven 1 hour, or until crisp and cooked through."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3548106.jpg",
    "recipeName": "Chef John\u0027s Buttermilk Fried Chicken",
    "recipeUrl": "https://www.allrecipes.com/recipe/220128/chef-johns-buttermilk-fried-chicken/",
    "ingredients": [
      "1 (3 1/2) pound chicken, cut into 8 pieces",
      "1 teaspoon black pepper",
      "1 teaspoon salt",
      "1 teaspoon paprika",
      "¼ teaspoon dried rosemary",
      "¼ teaspoon ground thyme",
      "¼ teaspoon dried oregano",
      "¼ teaspoon dried sage",
      "½ teaspoon white pepper",
      "¼ teaspoon cayenne pepper",
      "2 cups buttermilk",
      "2 cups flour",
      "1 teaspoon salt",
      "½ teaspoon paprika",
      "½ teaspoon cayenne pepper",
      "½ teaspoon garlic powder",
      "½ teaspoon white pepper",
      "½ teaspoon onion powder",
      "2 ½ quarts peanut oil for frying"
    ],
    "cookingInstructions": [
      "Step 1 Toss together chicken pieces, black pepper, salt, paprika, rosemary, thyme, oregano, sage, white pepper, and cayenne in a large bowl to coat. ",
      "Step 2 Stir in buttermilk until chicken is coated. Refrigerate for 6 hours.",
      "Step 3 Combine flour, salt, paprika, cayenne, garlic powder, white pepper, and onion powder in a large shallow dish.",
      "Step 4 Remove chicken from the buttermilk and dredge each piece in the seasoned flour. Shake off any excess and transfer to a plate.",
      "Step 5 Heat peanut oil in a large Dutch oven to 350 degrees F (175 degrees C). Add all the chicken to the pan and cook for 10 minutes.",
      "Step 6 Turn chicken pieces and cook for another 10-15 minutes.",
      "Step 7 Remove chicken from the oil and transfer to a cooling rack set over a paper towel lined baking sheet. Let sit for 10 minutes before serving."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F12%2F08%2Fslow-cooker-creamy-chicken-taco-soup-2000.jpg",
    "recipeName": "Slow Cooker Creamy Chicken Taco Soup",
    "recipeUrl": "https://www.allrecipes.com/recipe/278888/slow-cooker-creamy-chicken-taco-soup/",
    "ingredients": [
      "1 serving nonstick cooking spray",
      "1 cup diced onion",
      "1 cup diced bell pepper",
      "2 teaspoons salt, divided",
      "2 cups chicken broth",
      "1 (10 ounce) can diced tomatoes and green chiles (such as RO*TEL®)",
      "1 (10 ounce) can condensed cream of mushroom soup",
      "1 (4 ounce) can chopped green chiles (such as Ortega®)",
      "2 tablespoons oil",
      "1 tablespoon taco seasoning",
      "½ teaspoon ground cumin",
      "¼ teaspoon ground black pepper",
      "1 pound skinless, boneless chicken breast",
      "1 (8 ounce) package Neufchatel cheese, softened"
    ],
    "cookingInstructions": [
      "Step 1 Spray a slow cooker with cooking spray. Add onions, bell pepper, and 1 teaspoon salt. Stir in chicken broth, diced tomatoes, condensed soup, and chiles. ",
      "Step 2 Combine oil, taco seasoning, 1 teaspoon salt, cumin, and black pepper in a bowl. Add chicken and toss to coat on all sides. Transfer to the slow cooker.",
      "Step 3 Cook on Low until chicken is no longer pink in the center and the juices run clear, 2 to 3 hours. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove from the slow cooker and shred.",
      "Step 4 Add Neufchatel cheese to the slow cooker and stir until melted. Return chicken to the slow cooker and cook until warmed through, 20 to 30 minutes more."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6118643.jpg",
    "recipeName": "Mushroom, Broccoli, and Cheese Stuffed Chicken",
    "recipeUrl": "https://www.allrecipes.com/recipe/269707/mushroom-broccoli-and-cheese-stuffed-chicken/",
    "ingredients": [
      "2 cups finely chopped broccoli florets",
      "2 tablespoons water",
      "½ cup shredded pepperjack cheese",
      "¼ cup mayonnaise",
      "4 small button mushrooms, sliced",
      "1 teaspoon garlic powder",
      "4 large chicken breasts",
      "1 teaspoon paprika",
      "salt and ground black pepper to taste"
    ],
    "cookingInstructions": [
      "Step 1 Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil. ",
      "Step 2 Combine broccoli and water in a microwave-safe bowl. Cook in the microwave on high power for 2 minutes. Drain.",
      "Step 3 Combine cooked broccoli, pepperjack cheese, mayonnaise, mushrooms, and garlic powder in a large bowl.",
      "Step 4 Season both sides of each chicken breast with paprika, salt, and pepper. Use a sharp knife to cut a slice through the middle of each breast to create a deep pocket, making sure not to cut all the way through. Evenly stuff each breast with broccoli mixture and place on the prepared baking sheet.",
      "Step 5 Bake in the preheated oven until chicken is no longer pink in the center and juices run clear, about 35 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1411947.jpg",
    "recipeName": "Honey-Garlic Slow Cooker Chicken Thighs",
    "recipeUrl": "https://www.allrecipes.com/recipe/236609/honey-garlic-slow-cooker-chicken-thighs/",
    "ingredients": [
      "4 skinless, boneless chicken thighs",
      "½ cup soy sauce",
      "½ cup ketchup",
      "⅓ cup honey",
      "3 cloves garlic, minced",
      "1 teaspoon dried basil"
    ],
    "cookingInstructions": [
      "Step 1 Lay chicken thighs into the bottom of a 4-quart slow cooker. ",
      "Step 2 Whisk soy sauce, ketchup, honey, garlic, and basil together in a bowl; pour over the chicken.",
      "Step 3 Cook on Low for 6 hours."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5107151.jpg",
    "recipeName": "Chicken Marsala",
    "recipeUrl": "https://www.allrecipes.com/recipe/8887/chicken-marsala/",
    "ingredients": [
      "¼ cup all-purpose flour for coating",
      "½ teaspoon salt",
      "¼ teaspoon ground black pepper",
      "½ teaspoon dried oregano",
      "4 skinless, boneless chicken breast halves - pounded 1/4 inch thick",
      "4 tablespoons butter",
      "4 tablespoons olive oil",
      "1 cup sliced mushrooms",
      "½ cup Marsala wine",
      "¼ cup cooking sherry"
    ],
    "cookingInstructions": [
      "Step 1 In a shallow dish or bowl, mix together the flour, salt, pepper and oregano. Coat chicken pieces in flour mixture. ",
      "Step 2 In a large skillet, melt butter in oil over medium heat. Place chicken in the pan, and lightly brown. Turn over chicken pieces, and add mushrooms. Pour in wine and sherry. Cover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6967156.jpg",
    "recipeName": "Sheet Pan Parmesan Chicken and Veggies",
    "recipeUrl": "https://www.allrecipes.com/recipe/274966/sheet-pan-parmesan-chicken-and-veggies/",
    "ingredients": [
      "1 tablespoon dried oregano",
      "1 tablespoon dried parsley",
      "1 teaspoon paprika",
      "½ teaspoon garlic powder",
      "¼ teaspoon seasoned salt, or to taste",
      "¼ teaspoon ground black pepper, or to taste",
      "½ pound fresh green beans, trimmed",
      "1 small red potato, diced",
      "1 sweet bell pepper, chopped",
      "1 cup broccoli florets, chopped",
      "1 tablespoon minced garlic",
      "3 tablespoons olive oil",
      "⅓ cup all-purpose flour",
      "4 tablespoons butter, melted",
      "1 cup panko bread crumbs",
      "1 cup freshly grated Parmesan cheese, divided",
      "1 ½ pounds skinless, boneless chicken breasts, pounded flat",
      "½ cup mayonnaise",
      "¼ cup ketchup",
      "½ teaspoon garlic powder",
      "¼ teaspoon Worcestershire sauce"
    ],
    "cookingInstructions": [
      "Step 1 Preheat the oven to 400 degrees F (200 degrees C). Line a sheet pan with parchment paper. ",
      "Step 2 Combine oregano, parsley, paprika, garlic powder, seasoned salt, and pepper in a small bowl.",
      "Step 3 Place green beans, potato, bell pepper, broccoli, and garlic on the prepared sheet pan. Drizzle olive oil on top and sprinkle with 1/2 of the seasoning mix; toss to coat. Spread vegetables on one side of the pan.",
      "Step 4 Place flour in a bowl. Place melted butter in a second bowl. Combine panko, 2/3 cup Parmesan cheese, and the remaining 1/2 of the seasoning mix in a third bowl.",
      "Step 5 Remove any excess fat from chicken breasts and slice into 1 1/4 inch strips. Coat chicken strips in flour, then dredge in melted butter, and then dip in the Parmesan-panko mixture until heavily coated. Place on the empty half of the sheet pan and sprinkle with any remaining Parmesan-panko mixture, pressing onto the chicken.",
      "Step 6 Bake in the preheated oven for 10 minutes. Remove from the oven, flip chicken strips, stir the veggies, and return to the oven. Bake until chicken juices run clear and veggies are crisp-tender, 10 to 15 minutes. An instant-read thermometer inserted into the center of the chicken should read at least 165 degrees F (74 degrees C).",
      "Step 7 While the chicken is baking, whisk together mayonnaise, ketchup, garlic powder, and Worcestershire sauce.",
      "Step 8 Remove chicken and veggies from the oven. Toss veggies with remaining Parmesan cheese. Serve with dipping sauce."
    ]
  }
]