[
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5202473.jpg",
    "recipeName": "Hudson\u0027s Baked Tilapia with Dill Sauce",
    "recipeUrl": "https://www.allrecipes.com/recipe/74169/hudsons-baked-tilapia-with-dill-sauce/",
    "ingredients": [
      "4 (4 ounce) fillets tilapia",
      "salt and pepper to taste",
      "1 tablespoon Cajun seasoning, or to taste",
      "1 lemon, thinly sliced",
      "¼ cup mayonnaise",
      "½ cup sour cream",
      "⅛ teaspoon garlic powder",
      "1 teaspoon fresh lemon juice",
      "2 tablespoons chopped fresh dill"
    ],
    "cookingInstructions": [
      "Step 1 Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish. ",
      "Step 2 Season the tilapia fillets with salt, pepper and Cajun seasoning on both sides. Arrange the seasoned fillets in a single layer in the baking dish. Place a layer of lemon slices over the fish fillets. I usually use about 2 slices on each piece so that it covers most of the surface of the fish.",
      "Step 3 Bake uncovered for 15 to 20 minutes in the preheated oven, or until fish flakes easily with a fork.",
      "Step 4 While the fish is baking, mix together the mayonnaise, sour cream, garlic powder, lemon juice and dill in a small bowl. Serve with tilapia."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F959780.jpg",
    "recipeName": "Grilled Salmon",
    "recipeUrl": "https://www.allrecipes.com/recipe/228227/grilled-salmon/",
    "ingredients": [
      "½ cup olive oil",
      "¼ cup lemon juice",
      "4 green onions, thinly sliced",
      "1 tablespoon chopped fresh parsley",
      "1 teaspoon chopped fresh rosemary",
      "1 teaspoon chopped fresh thyme",
      "½ teaspoon salt",
      "⅛ teaspoon black pepper",
      "⅛ teaspoon garlic powder",
      "3 pounds salmon fillets"
    ],
    "cookingInstructions": [
      "Step 1 Combine olive oil, lemon juice, green onions, parsley, rosemary, thyme, salt, black pepper, and garlic powder in a small bowl. Set aside 1/4 cup of the marinade. Place salmon in a shallow dish and pour the remaining marinade over the top. Cover and refrigerate for 30 minutes. Remove the salmon and discard the used marinade. ",
      "Step 2 Preheat grill for medium heat and lightly oil the grate.",
      "Step 3 Place salmon on the preheated grill skin side down. Cook, basting occasionally with the reserved marinade, until the fish flakes easily with a fork, 15 to 20 minutes."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4529143.jpg",
    "recipeName": "Veracruz-Style Red Snapper",
    "recipeUrl": "https://www.allrecipes.com/recipe/228046/veracruz-style-red-snapper/",
    "ingredients": [
      "2 tablespoons olive oil",
      "½ white onion, diced",
      "3 cloves garlic, minced",
      "1 tablespoon capers",
      "1 tablespoon caper juice",
      "1 cup cherry tomatoes, halved",
      "⅓ cup pitted, sliced green olives (such as Castelvetrano)",
      "1 jalapeno pepper, seeded and chopped",
      "2 teaspoons chopped fresh oregano",
      "2 teaspoons olive oil",
      "2 (7 ounce) red snapper fillets, cut in half",
      "salt and pepper to taste",
      "½ teaspoon cayenne pepper, or more to taste",
      "2 limes, juiced"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 425 degrees F (220 degrees C). ",
      "Step 2 Heat olive oil in a skillet over medium heat. Stir in onion; cook and stir until onions begin to turn translucent, 6 to 7 minutes.",
      "Step 3 Cook and stir in garlic until fragrant, about 30 seconds. Add capers and caper juice; stir to combine.",
      "Step 4 Stir in tomatoes, olives, jalapeno pepper, . Cook and stir until jalapeno pepper softens and tomatoes begin to collapse, about 3 minutes. Remove from heat; stir in oregano.",
      "Step 5 Drizzle 1 teaspoon olive oil into a small baking dish. Sprinkle in 1 tablespoon of the tomato-olive mixture. Top with 1 snapper fillet, salt, black pepper, and cayenne pepper. Top with more filling and juice from 1 lime. Repeat with remaining snapper fillet, seasoning, and lime juice in a second baking dish.",
      "Step 6 Bake in the preheated oven until fish is flaky and no longer translucent, 15 to 20 minutes."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F630224.jpg",
    "recipeName": "Blackened Tuna",
    "recipeUrl": "https://www.allrecipes.com/recipe/18377/blackened-tuna/",
    "ingredients": [
      "1 ½ pounds fresh tuna steaks, 1 inch thick",
      "2 tablespoons Cajun seasoning",
      "2 tablespoons olive oil",
      "2 tablespoons butter"
    ],
    "cookingInstructions": [
      "Step 1 Generously coat tuna with Cajun seasoning. ",
      "Step 2 Heat oil and butter in a large skillet over high heat. When oil is nearly smoking, place steaks in pan. Cook on one side for 3 to 4 minutes, or until blackened. Turn steaks, and cook for 3 to 4 minutes, or to desired doneness."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F425659.jpg",
    "recipeName": "Barlow\u0027s Blackened Catfish",
    "recipeUrl": "https://www.allrecipes.com/recipe/38107/barlows-blackened-catfish/",
    "ingredients": [
      "2 teaspoons cayenne pepper",
      "2 teaspoons lemon pepper",
      "2 teaspoons garlic powder",
      "2 teaspoons salt",
      "2 teaspoons pepper",
      "1 pound catfish fillets",
      "2 tablespoons butter",
      "1 cup Italian-style salad dressing"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking dish. ",
      "Step 2 In a shallow, medium bowl, mix cayenne pepper, lemon pepper, garlic powder, salt and pepper.",
      "Step 3 Brush both sides of catfish fillets with butter. Rub fillets with the cayenne pepper mixture on both sides.",
      "Step 4 Heat a large heavy skillet over medium-high heat until really hot. Add fillets, and fry approximately 2 minutes on each side, until slightly blackened.",
      "Step 5 Arrange blackened fillets in a single layer in the prepared baking dish, and coat with Italian-style salad dressing. Bake 30 to 35 minutes in the preheated oven, until fish is easily flaked with a fork."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F240492.jpg",
    "recipeName": "Capers and Halibut",
    "recipeUrl": "https://www.allrecipes.com/recipe/50392/capers-and-halibut/",
    "ingredients": [
      "1 tablespoon olive oil",
      "2 (8 ounce) steaks halibut",
      "½ cup white wine",
      "1 teaspoon chopped garlic",
      "¼ cup butter",
      "salt and pepper to taste",
      "3 tablespoons capers, with liquid"
    ],
    "cookingInstructions": [
      "Step 1 Heat the olive oil in a large skillet over medium-high heat. Fry the halibut steaks on all sides until nicely browned. Remove from pan, and set aside. ",
      "Step 2 Pour the wine into the pan, and use a spatula to scrape any browned bits from the bottom. Let the wine reduce to almost nothing, then stir in the garlic, butter and capers. Season with salt and pepper to taste. Let the sauce simmer for a minute to blend the flavors.",
      "Step 3 Return the steaks to the pan, and coat them with sauce. Cook until fish flakes easily with a fork. Serve fish immediately with the sauce from the pan poured over it."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1017268.jpg",
    "recipeName": "Quick Fish Tacos",
    "recipeUrl": "https://www.allrecipes.com/recipe/221936/quick-fish-tacos/",
    "ingredients": [
      "¼ cup reduced-fat sour cream",
      "2 tablespoons lime juice",
      "salt and ground black pepper to taste",
      "1 jalapeno pepper, halved lengthwise",
      "2 ½ cups shredded red cabbage",
      "4 green onions, thinly sliced",
      "2 tablespoons olive oil",
      "1 pound tilapia fillets, cut into strips",
      "8 (6 inch) flour tortillas",
      "½ cup chopped fresh cilantro"
    ],
    "cookingInstructions": [
      "Step 1 Mix sour cream and lime juice together in a large bowl; season with salt and black pepper. Reserve about half the mixture in another bowl for serving. Mince half the jalapeno pepper; save other half for later. Toss cabbage, green onions, and minced jalapeno half in remaining sour cream mixture until slaw is well mixed. ",
      "Step 2 Heat olive oil and remaining jalapeno half in a large skillet over medium heat; swirl oil to coat skillet evenly. Season tilapia fillets with salt and pepper. Pan-fry fish strips in the skillet in 2 batches until fish is golden brown and easily flaked with a fork, 5 to 6 minutes. Discard jalapeno half.",
      "Step 3 Heat tortillas in the microwave on high until warm, 20 to 30 seconds.",
      "Step 4 Serve fish in warmed tortillas topped with cabbage slaw, reserved sour cream mixture, and cilantro."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F256938.jpg",
    "recipeName": "Spanish Moroccan Fish",
    "recipeUrl": "https://www.allrecipes.com/recipe/133895/spanish-moroccan-fish/",
    "ingredients": [
      "1 tablespoon vegetable oil",
      "1 onion, chopped",
      "1 clove garlic, finely chopped",
      "1 (15 ounce) can garbanzo beans, drained and rinsed",
      "2 red bell peppers, seeded and sliced into strips",
      "1 large carrot, thinly sliced",
      "3 tomatoes, chopped",
      "4 olives, chopped",
      "¼ cup chopped fresh parsley",
      "¼ cup ground cumin",
      "3 tablespoons paprika",
      "2 tablespoons chicken bouillon granules",
      "1 teaspoon cayenne pepper",
      "salt to taste",
      "5 pounds tilapia fillets"
    ],
    "cookingInstructions": [
      "Step 1 Heat vegetable oil in a skillet over medium heat. Stir in onion and garlic; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add garbanzo beans, bell peppers, carrots, tomatoes, and olives; continue to cook until the peppers are slightly tender, about 5 minutes more. ",
      "Step 2 Sprinkle parsley, cumin, paprika, chicken bouillon, and cayenne over the vegetables. Season with salt. Stir to incorporate. Place tilapia on top of the vegetables and add enough water to cover the vegetables. Reduce heat to low, cover, and cook until fish flakes easily with a fork and juices run clear, about 40 minutes."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F779645.jpg",
    "recipeName": "Indian Fish Curry",
    "recipeUrl": "https://www.allrecipes.com/recipe/213238/indian-fish-curry/",
    "ingredients": [
      "2 teaspoons Dijon mustard",
      "1 teaspoon ground black pepper",
      "½ teaspoon salt",
      "2 tablespoons canola oil",
      "4 white fish fillets",
      "1 onion, coarsely chopped",
      "4 cloves garlic, roughly chopped",
      "1 (1 inch) piece fresh ginger root, peeled and chopped",
      "5 cashew halves",
      "1 tablespoon canola oil",
      "2 teaspoons cayenne pepper, or to taste",
      "½ teaspoon ground turmeric",
      "1 teaspoon ground cumin",
      "1 teaspoon ground coriander",
      "1 teaspoon salt",
      "1 teaspoon white sugar",
      "½ cup chopped tomato",
      "¼ cup vegetable broth",
      "¼ cup chopped fresh cilantro"
    ],
    "cookingInstructions": [
      "Step 1 Mix the mustard, pepper, 1/2 teaspoon salt, and 2 tablespoons of canola oil in a shallow bowl. Add the fish fillets, turning to coat. Marinate the fish in the refrigerator for 30 minutes. ",
      "Step 2 Combine the onion, garlic, ginger, and cashews in a blender or food processor and pulse until the mixture forms a paste.",
      "Step 3 Preheat an oven to 350 degrees F (175 degrees C).",
      "Step 4 Heat 1 tablespoon of canola oil in a skillet over medium-low heat. Stir in the prepared paste; cook and stir for a minute or two. Add the cayenne pepper, turmeric, cumin, coriander, 1 teaspoon salt, and sugar. Cook and stir for an additional five minutes. Stir in the chopped tomato and vegetable broth.",
      "Step 5 Arrange the fish fillets in a baking dish, discarding any extra marinade. Top the fish with the sauce, cover the baking dish, and bake in the preheated oven until the fish flakes easily with a fork, about 30 minutes. Garnish with chopped cilantro."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F853971.jpg",
    "recipeName": "Fried Bass",
    "recipeUrl": "https://www.allrecipes.com/recipe/185561/fried-bass/",
    "ingredients": [
      "1 cup peanut oil for frying, or as needed",
      "3 eggs",
      "1 tablespoon water",
      "3 (6 ounce) fillets striped bass fillets, skinned",
      "1 teaspoon Cajun seasoning",
      "1 teaspoon lemon pepper",
      "½ cup flour",
      "1 (1 ounce) package salt-and-vinegar potato chips, crushed",
      "1 lemon, cut into wedges"
    ],
    "cookingInstructions": [
      "Step 1 Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Whisk eggs and water together in a bowl; set the egg wash aside. ",
      "Step 2 Sprinkle the bass fillets on both sides with Cajun seasoning and lemon pepper. Dredge the fillets in flour, and shake off any excess. Dip the fillets in the egg wash, then dip fillets in the crushed potato chips.",
      "Step 3 Fry the fish in the preheated skillet until lightly browned, about 4 minutes per side. Serve with lemon wedges."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F375819.jpg",
    "recipeName": "Yogurt-Marinated Salmon Fillets (Dahi Machhali Masaledar)",
    "recipeUrl": "https://www.allrecipes.com/recipe/142250/yogurt-marinated-salmon-fillets-dahi-machhali-masaledar/",
    "ingredients": [
      "1 cup fat-free plain yogurt",
      "½ tablespoon cayenne pepper",
      "6 cloves garlic, minced",
      "2 (2 inch) pieces fresh ginger root, minced",
      "2 tablespoons cilantro, finely chopped",
      "1 tablespoon ground coriander seed",
      "1 teaspoon ground cumin",
      "1 teaspoon salt",
      "¼ teaspoon ground turmeric",
      "4 (6 ounce) skinless, boneless salmon fillets"
    ],
    "cookingInstructions": [
      "Step 1 Combine the yogurt, cayenne pepper, garlic, ginger, cilantro, ground coriander, cumin, salt and turmeric in a resealable plastic bag. Close bag and mix everything together until evenly combined. Add the salmon and toss until well coated with the marinade; marinate overnight. ",
      "Step 2 Preheat the oven broiler. Lightly grease a baking pan.",
      "Step 3 Remove salmon from marinade and shake off excess; discard remaining marinade. Place onto prepared baking pan and broil in preheated oven until salmon flakes easily with a fork, five to seven minutes per side."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F970913.jpg",
    "recipeName": "Seasoned Swai Fish Fillet",
    "recipeUrl": "https://www.allrecipes.com/recipe/230382/seasoned-swai-fish-fillet/",
    "ingredients": [
      "cooking spray",
      "4 (4 ounce) fillets swai fish",
      "2 tablespoons margarine",
      "¼ cup dry white wine",
      "1 tablespoon lemon juice",
      "1 tablespoon chopped fresh cilantro (Optional)",
      "1 teaspoon minced garlic",
      "1 teaspoon salt",
      "1 teaspoon ground black pepper",
      "1 teaspoon paprika"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 350 degrees F (175 degrees C). Spray a shallow pan or baking sheet with cooking spray. ",
      "Step 2 Place fish fillets into the prepared pan.",
      "Step 3 Heat margarine in a saucepan over medium heat. Mix white wine, lemon juice, cilantro, garlic, salt, and black pepper into the melted margarine; simmer sauce for 2 minutes. Generously spoon sauce over fish fillets. Sprinkle fillets with paprika.",
      "Step 4 Bake in the preheated oven until fish flakes easily with a fork, 10 to 12 minutes."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2615015.jpg",
    "recipeName": "Best Tuna Casserole",
    "recipeUrl": "https://www.allrecipes.com/recipe/17219/best-tuna-casserole/",
    "ingredients": [
      "1 (12 ounce) package egg noodles",
      "¼ cup chopped onion",
      "2 cups shredded Cheddar cheese",
      "1 cup frozen green peas",
      "2 (5 ounce) cans tuna, drained",
      "2 (10.75 ounce) cans condensed cream of mushroom soup",
      "½ (4.5 ounce) can sliced mushrooms",
      "1 cup crushed potato chips"
    ],
    "cookingInstructions": [
      "Step 1 Bring a large pot of lightly salted water to a boil. Cook pasta in boiling water for 8 to 10 minutes, or until al dente; drain. ",
      "Step 2 Preheat oven to 425 degrees F (220 degrees C).",
      "Step 3 In a large bowl, thoroughly mix noodles, onion, 1 cup cheese, peas, tuna, soup and mushrooms. Transfer to a 9x13 inch baking dish, and top with potato chip crumbs and remaining 1 cup cheese.",
      "Step 4 Bake for 15 to 20 minutes in the preheated oven, or until cheese is bubbly."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4470536.jpg",
    "recipeName": "Chef John\u0027s Fresh Salmon Cakes",
    "recipeUrl": "https://www.allrecipes.com/recipe/239541/chef-johns-fresh-salmon-cakes/",
    "ingredients": [
      "1 tablespoon extra-virgin olive oil",
      "¼ cup minced onion",
      "2 tablespoons minced red bell pepper",
      "2 tablespoons minced celery",
      "salt and pepper to taste",
      "1 tablespoon capers",
      "1 ¼ pounds fresh wild salmon, coarsely chopped",
      "¼ cup mayonnaise",
      "¼ cup panko bread crumbs",
      "2 cloves garlic, minced",
      "1 teaspoon Dijon mustard",
      "1 pinch cayenne pepper",
      "1 pinch seafood seasoning (such as Old Bay®)",
      "1 tablespoon panko bread crumbs, or to taste",
      "2 tablespoons olive oil, or as needed"
    ],
    "cookingInstructions": [
      "Step 1 Heat extra virgin olive oil in a skillet over medium heat. Cook and stir onion, red pepper, celery, and a pinch of salt in hot oil until onion is soft and translucent, about 5 minutes. Add capers; cook and stir until fragrant, about 2 minutes. Remove from heat and cool to room temperature. ",
      "Step 2 Stir salmon, onion mixture, mayonnaise, 1/4 cup bread crumbs, garlic, mustard, cayenne, seafood seasoning, salt, and ground black pepper together in a bowl until well-mixed. Cover the bowl with plastic wrap and refrigerate until firmed and chilled, 1 to 2 hours.",
      "Step 3 Form salmon mixture into four 1-inch thick patties; sprinkle remaining panko bread crumbs over each patty.",
      "Step 4 Heat olive oil in a skillet over medium-heat. Cook patties in hot oil until golden and cooked through, 3 to 4 minutes per side."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7697013.jpg",
    "recipeName": "Salmon Patties I",
    "recipeUrl": "https://www.allrecipes.com/recipe/9401/salmon-patties-i/",
    "ingredients": [
      "1 (14.75 ounce) can canned salmon",
      "1 egg",
      "¼ cup chopped onion",
      "½ cup seasoned dry bread crumbs",
      "1 tablespoon olive oil"
    ],
    "cookingInstructions": [
      "Step 1 Drain and reserve liquid from salmon. Mix egg, onion, bread crumbs and salmon together. ",
      "Step 2 Make into patties. If mixture is too dry to form into patties, add reserved liquid from salmon.",
      "Step 3 In a frying pan, heat olive oil. Place patties in pan. Brown on each side, turning gently. Drain on paper towels and serve."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F365400.jpg",
    "recipeName": "Miso Soup",
    "recipeUrl": "https://www.allrecipes.com/recipe/13107/miso-soup/",
    "ingredients": [
      "2 teaspoons dashi granules",
      "4 cups water",
      "3 tablespoons miso paste",
      "1 (8 ounce) package silken tofu, diced",
      "2 green onions, sliced diagonally into 1/2 inch pieces"
    ],
    "cookingInstructions": [
      "Step 1 In a medium saucepan over medium-high heat, combine dashi granules and water; bring to a boil. Reduce heat to medium, and whisk in the miso paste. Stir in tofu. Separate the layers of the green onions, and add them to the soup. Simmer gently for 2 to 3 minutes before serving. "
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F785713.jpg",
    "recipeName": "Grandma\u0027s Famous Salmon Cakes",
    "recipeUrl": "https://www.allrecipes.com/recipe/24509/grandmas-famous-salmon-cakes/",
    "ingredients": [
      "1 (14.75 ounce) can salmon, drained and flaked",
      "2 eggs, beaten",
      "1 small onion, diced",
      "1 teaspoon ground black pepper",
      "3 tablespoons vegetable oil"
    ],
    "cookingInstructions": [
      "Step 1 Pick through the salmon and remove any bones. In a mixing bowl, beat the eggs and add the diced onion, salmon and pepper. Mix thoroughly. ",
      "Step 2 Shape into 2 ounce patties; about 7 or 8 patties. In a large skillet over medium heat, heat the oil. Fry each patty for 5 minutes on each side or until crispy and golden brown."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1608428.jpg",
    "recipeName": "Marinated Tuna Steak",
    "recipeUrl": "https://www.allrecipes.com/recipe/39455/marinated-tuna-steak/",
    "ingredients": [
      "¼ cup orange juice",
      "¼ cup soy sauce",
      "2 tablespoons olive oil",
      "1 tablespoon lemon juice",
      "2 tablespoons chopped fresh parsley",
      "1 clove garlic, minced",
      "½ teaspoon chopped fresh oregano",
      "½ teaspoon ground black pepper",
      "4 (4 ounce) tuna steaks"
    ],
    "cookingInstructions": [
      "Step 1 In a large non-reactive dish, mix together the orange juice, soy sauce, olive oil, lemon juice, parsley, garlic, oregano, and pepper. Place the tuna steaks in the marinade and turn to coat. Cover, and refrigerate for at least 30 minutes. ",
      "Step 2 Preheat grill for high heat.",
      "Step 3 Lightly oil grill grate. Cook the tuna steaks for 5 to 6 minutes, then turn and baste with the marinade. Cook for an additional 5 minutes, or to desired doneness. Discard any remaining marinade."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4127609.jpg",
    "recipeName": "Campbell\u0027s® Tuna Noodle Casserole",
    "recipeUrl": "https://www.allrecipes.com/recipe/151593/campbells-tuna-noodle-casserole/",
    "ingredients": [
      "2 (10.75 ounce) cans Campbell\u0027s® Condensed Cream of Mushroom Soup (regular or 25% Lower Sodium)",
      "1 cup milk",
      "2 cups frozen peas",
      "2 (10 ounce) cans tuna, drained",
      "4 cups hot cooked medium egg noodles",
      "2 tablespoons dry bread crumbs",
      "1 tablespoon butter, melted"
    ],
    "cookingInstructions": [
      "Step 1 Stir soup, milk, peas, tuna and noodles in 3-quart casserole. ",
      "Step 2 Bake at 400 degrees F for 30 minutes or until hot. Stir.",
      "Step 3 Mix bread crumbs with butter in bowl and sprinkle over tuna mixture. Bake for 5 minutes more."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F762704.jpg",
    "recipeName": "Seared Ahi Tuna Steaks",
    "recipeUrl": "https://www.allrecipes.com/recipe/160099/seared-ahi-tuna-steaks/",
    "ingredients": [
      "2 (5 ounce) ahi tuna steaks",
      "1 teaspoon kosher salt",
      "¼ teaspoon cayenne pepper",
      "½ tablespoon butter",
      "2 tablespoons olive oil",
      "1 teaspoon whole peppercorns"
    ],
    "cookingInstructions": [
      "Step 1 Season the tuna steaks with salt and cayenne pepper. ",
      "Step 2 Melt the butter with the olive oil in a skillet over medium-high heat. Cook the peppercorns in the mixture until they soften and pop, about 5 minutes. Gently place the seasoned tuna in the skillet and cook to desired doneness, 1 1/2 minutes per side for rare."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4523973.jpg",
    "recipeName": "Perfect Ten Baked Cod",
    "recipeUrl": "https://www.allrecipes.com/recipe/228319/perfect-ten-baked-cod/",
    "ingredients": [
      "2 tablespoons butter",
      "½ sleeve buttery round crackers (such as Ritz®), crushed",
      "2 tablespoons butter",
      "1 pound thick-cut cod loin",
      "½ lemon, juiced",
      "¼ cup dry white wine",
      "1 tablespoon chopped fresh parsley",
      "1 tablespoon chopped green onion",
      "1 lemon, cut into wedges"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 400 degrees F (200 degrees C). ",
      "Step 2 Place 2 tablespoons butter in a microwave-safe bowl; melt in microwave on high, about 30 seconds. Stir buttery round crackers into melted butter.",
      "Step 3 Place remaining 2 tablespoons butter in a 7x11-inch baking dish. Melt in the preheated oven, 1 to 3 minutes. Remove dish from oven.",
      "Step 4 Coat both sides of cod in melted butter in the baking dish.",
      "Step 5 Bake cod in the preheated oven for 10 minutes. Remove from oven; top with lemon juice, wine, and cracker mixture. Place back in oven and bake until fish is opaque and flakes easily with a fork, about 10 more minutes.",
      "Step 6 Garnish baked cod with parsley and green onion. Serve with lemon wedges."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F800839.jpg",
    "recipeName": "Grilled Salmon I",
    "recipeUrl": "https://www.allrecipes.com/recipe/12720/grilled-salmon-i/",
    "ingredients": [
      "1 ½ pounds salmon fillets",
      "lemon pepper to taste",
      "garlic powder to taste",
      "salt to taste",
      "⅓ cup soy sauce",
      "⅓ cup brown sugar",
      "⅓ cup water",
      "¼ cup vegetable oil"
    ],
    "cookingInstructions": [
      "Step 1 Season salmon fillets with lemon pepper, garlic powder, and salt. ",
      "Step 2 In a small bowl, stir together soy sauce, brown sugar, water, and vegetable oil until sugar is dissolved. Place fish in a large resealable plastic bag with the soy sauce mixture, seal, and turn to coat. Refrigerate for at least 2 hours.",
      "Step 3 Preheat grill for medium heat.",
      "Step 4 Lightly oil grill grate. Place salmon on the preheated grill, and discard marinade. Cook salmon for 6 to 8 minutes per side, or until the fish flakes easily with a fork."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F862371.jpg",
    "recipeName": "Maple Salmon",
    "recipeUrl": "https://www.allrecipes.com/recipe/51283/maple-salmon/",
    "ingredients": [
      "¼ cup maple syrup",
      "2 tablespoons soy sauce",
      "1 clove garlic, minced",
      "¼ teaspoon garlic salt",
      "⅛ teaspoon ground black pepper",
      "1 pound salmon"
    ],
    "cookingInstructions": [
      "Step 1 In a small bowl, mix the maple syrup, soy sauce, garlic, garlic salt, and pepper. ",
      "Step 2 Place salmon in a shallow glass baking dish, and coat with the maple syrup mixture. Cover the dish, and marinate salmon in the refrigerator 30 minutes, turning once.",
      "Step 3 Preheat oven to 400 degrees F (200 degrees C).",
      "Step 4 Place the baking dish in the preheated oven, and bake salmon uncovered 20 minutes, or until easily flaked with a fork."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4535513.jpg",
    "recipeName": "Simple Broiled Haddock",
    "recipeUrl": "https://www.allrecipes.com/recipe/232906/simple-broiled-haddock/",
    "ingredients": [
      "cooking spray",
      "2 pounds haddock fillets",
      "½ teaspoon onion powder",
      "½ teaspoon paprika",
      "½ teaspoon garlic powder",
      "½ teaspoon ground black pepper",
      "½ teaspoon salt",
      "¼ teaspoon cayenne pepper",
      "1 tablespoon butter, cut in small pieces",
      "1 lemon, cut into wedges"
    ],
    "cookingInstructions": [
      "Step 1 Set oven rack about 6 inches from the heat source and preheat the oven\u0027s broiler. Line a baking sheet with aluminum foil and spray with cooking spray. ",
      "Step 2 Arrange haddock fillets on the prepared baking sheet. Mix onion powder, paprika, garlic powder, salt, black pepper, and cayenne pepper in a small bowl; sprinkle seasoning over haddock. Dot haddock with pieces of butter.",
      "Step 3 Broil in the preheated oven until fish is easily flaked with a fork, 6 to 8 minutes. Serve with lemon wedges."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1031128.jpg",
    "recipeName": "Easy Tuna Patties",
    "recipeUrl": "https://www.allrecipes.com/recipe/230857/easy-tuna-patties/",
    "ingredients": [
      "2 eggs",
      "2 teaspoons lemon juice",
      "3 tablespoons grated Parmesan cheese",
      "10 tablespoons Italian-seasoned bread crumbs",
      "3 (5 ounce) cans tuna, drained",
      "3 tablespoons diced onion",
      "1 pinch ground black pepper",
      "3 tablespoons vegetable oil"
    ],
    "cookingInstructions": [
      "Step 1 Beat eggs and lemon juice in a bowl; stir in Parmesan cheese and bread crumbs to make a paste. Fold in tuna and onion until well-mixed. Season with black pepper. Shape tuna mixture into eight 1-inch-thick patties. ",
      "Step 2 Heat vegetable oil in a skillet over medium heat; fry patties until golden brown, about 5 minutes per side."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5406263.jpg",
    "recipeName": "Baked Haddock",
    "recipeUrl": "https://www.allrecipes.com/recipe/100195/baked-haddock/",
    "ingredients": [
      "¾ cup milk",
      "2 teaspoons salt",
      "¾ cup bread crumbs",
      "¼ cup grated Parmesan cheese",
      "¼ teaspoon ground dried thyme",
      "4 haddock fillets",
      "¼ cup butter, melted"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 500 degrees F (260 degrees C). ",
      "Step 2 In a small bowl, combine the milk and salt. In a separate bowl, mix together the bread crumbs, Parmesan cheese, and thyme. Dip the haddock fillets in the milk, then press into the crumb mixture to coat. Place haddock fillets in a glass baking dish, and drizzle with melted butter.",
      "Step 3 Bake on the top rack of the preheated oven until the fish flakes easily, about 15 minutes."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F970421.jpg",
    "recipeName": "Classic Fish and Chips",
    "recipeUrl": "https://www.allrecipes.com/recipe/16580/classic-fish-and-chips/",
    "ingredients": [
      "4 large potatoes, peeled and cut into strips",
      "1 cup all-purpose flour",
      "1 teaspoon baking powder",
      "1 teaspoon salt",
      "1 teaspoon ground black pepper",
      "1 cup milk",
      "1 egg",
      "1 quart vegetable oil for frying",
      "1 ½ pounds cod fillets"
    ],
    "cookingInstructions": [
      "Step 1 Place potatoes in a medium-size bowl of cold water. In a separate medium-size mixing bowl, mix together flour, baking powder, salt, and pepper. Stir in the milk and egg; stir until the mixture is smooth. Let mixture stand for 20 minutes. ",
      "Step 2 Preheat the oil in a large pot or electric skillet to 350 degrees F (175 degrees C).",
      "Step 3 Fry the potatoes in the hot oil until they are tender. Drain them on paper towels.",
      "Step 4 Dredge the fish in the batter, one piece at a time, and place them in the hot oil. Fry until the fish is golden brown. If necessary, increase the heat to maintain the 350 degrees F (175 degrees C) temperature. Drain well on paper towels.",
      "Step 5 Fry the potatoes again for 1 to 2 minutes for added crispness."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F877476.jpg",
    "recipeName": "Baked Dijon Salmon",
    "recipeUrl": "https://www.allrecipes.com/recipe/21176/baked-dijon-salmon/",
    "ingredients": [
      "¼ cup butter, melted",
      "3 tablespoons Dijon mustard",
      "1 ½ tablespoons honey",
      "¼ cup dry bread crumbs",
      "¼ cup finely chopped pecans",
      "4 teaspoons chopped fresh parsley",
      "4 (4 ounce) fillets salmon",
      "salt and pepper to taste",
      "1 lemon, for garnish"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 400 degrees F (200 degrees C). ",
      "Step 2 In a small bowl, stir together butter, mustard, and honey. Set aside. In another bowl, mix together bread crumbs, pecans, and parsley.",
      "Step 3 Brush each salmon fillet lightly with honey mustard mixture, and sprinkle the tops of the fillets with the bread crumb mixture.",
      "Step 4 Bake salmon 12 to 15 minutes in the preheated oven, or until it flakes easily with a fork. Season with salt and pepper, and garnish with a wedge of lemon."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F681641.jpg",
    "recipeName": "Pan-Seared Tilapia",
    "recipeUrl": "https://www.allrecipes.com/recipe/201934/pan-seared-tilapia/",
    "ingredients": [
      "4 (4 ounce) fillets tilapia",
      "salt and pepper to taste",
      "½ cup all-purpose flour",
      "1 tablespoon olive oil",
      "2 tablespoons unsalted butter, melted"
    ],
    "cookingInstructions": [
      "Step 1 Rinse tilapia fillets in cold water and pat dry with paper towels. Season both sides of each fillet with salt and pepper. Place the flour in a shallow dish; gently press each fillet into the flour to coat and shake off the excess flour. ",
      "Step 2 Heat the olive oil in a skillet over medium-high heat; cook the tilapia in the hot oil until the fish flakes easily with a fork, about 4 minutes per side. Brush the melted butter onto the tilapia in the last minute before removing from the skillet. Serve immediately."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5267924.jpg",
    "recipeName": "Ahi Poke Basic",
    "recipeUrl": "https://www.allrecipes.com/recipe/12870/ahi-poke-basic/",
    "ingredients": [
      "2 pounds fresh tuna steaks, cubed",
      "1 cup soy sauce",
      "¾ cup chopped green onions",
      "2 tablespoons sesame oil",
      "1 tablespoon toasted sesame seeds",
      "1 tablespoon crushed red pepper (Optional)",
      "2 tablespoons finely chopped macadamia nuts"
    ],
    "cookingInstructions": [
      "Step 1 In a medium size non-reactive bowl, combine Ahi, soy sauce, green onions, sesame oil, sesame seeds, chili pepper, and macadamia nuts; mix well. Refrigerate at least 2 hours before serving. "
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2224161.jpg",
    "recipeName": "Southern Fried Catfish",
    "recipeUrl": "https://www.allrecipes.com/recipe/140930/southern-fried-catfish/",
    "ingredients": [
      "½ cup buttermilk",
      "½ cup water",
      "salt and pepper, to taste",
      "1 pound catfish fillets, cut in strips",
      "1 ½ cups fine cornmeal",
      "½ cup all-purpose flour",
      "1 teaspoon seafood seasoning, such as Old Bay™",
      "1 quart vegetable oil for deep frying"
    ],
    "cookingInstructions": [
      "Step 1 In a small bowl, mix buttermilk, water, salt, and pepper. Pour mixture into a flat pan large enough to hold the fillets. Spread fish in one layer over bottom of pan, turning to coat each side, and set aside to marinate. ",
      "Step 2 In a 2 gallon resealable plastic bag, combine the cornmeal, flour, and seafood seasoning. Add fish to mixture, a few fillets at a time, and tumble gently to coat evenly.",
      "Step 3 Heat oil in deep fryer to 365 degrees F (185 degrees C).",
      "Step 4 Deep fry fillets until golden brown, about 3 minutes. Avoid overcrowding so fillets have room to brown properly. Fish should be slightly crisp outside, and moist and flaky inside. Drain on paper towels."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4567331.jpg",
    "recipeName": "Air-Fried Crumbed Fish",
    "recipeUrl": "https://www.allrecipes.com/recipe/260624/air-fried-crumbed-fish/",
    "ingredients": [
      "1 cup dry bread crumbs",
      "¼ cup vegetable oil",
      "4 flounder fillets",
      "1 egg, beaten",
      "1 lemon, sliced"
    ],
    "cookingInstructions": [
      "Step 1 Preheat an air fryer to 350 degrees F (180 degrees C). ",
      "Step 2 Mix bread crumbs and oil together in a bowl. Stir until mixture becomes loose and crumbly.",
      "Step 3 Dip fish fillets into the egg; shake off any excess. Dip fillets into the bread crumb mixture; coat evenly and fully.",
      "Step 4 Lay coated fillets gently in the preheated air fryer. Cook until fish flakes easily with a fork, about 12 minutes. Garnish with lemon slices."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1095418.jpg",
    "recipeName": "Blackened Salmon Fillets",
    "recipeUrl": "https://www.allrecipes.com/recipe/36487/blackened-salmon-fillets/",
    "ingredients": [
      "2 tablespoons ground paprika",
      "1 tablespoon ground cayenne pepper",
      "1 tablespoon onion powder",
      "2 teaspoons salt",
      "½ teaspoon ground white pepper",
      "½ teaspoon ground black pepper",
      "¼ teaspoon dried thyme",
      "¼ teaspoon dried basil",
      "¼ teaspoon dried oregano",
      "4 salmon fillets, skin and bones removed",
      "½ cup unsalted butter, melted"
    ],
    "cookingInstructions": [
      "Step 1 In a small bowl, mix paprika, cayenne pepper, onion powder, salt, white pepper, black pepper, thyme, basil and oregano. ",
      "Step 2 Brush salmon fillets on both sides with 1/4 cup butter, and sprinkle evenly with the cayenne pepper mixture. Drizzle one side of each fillet with 1/2 remaining butter.",
      "Step 3 In a large, heavy skillet over high heat, cook salmon, butter side down, until blackened, 2 to 5 minutes. Turn fillets, drizzle with remaining butter, and continue cooking until blackened and fish is easily flaked with a fork."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4557502.jpg",
    "recipeName": "Fish Tacos",
    "recipeUrl": "https://www.allrecipes.com/recipe/53729/fish-tacos/",
    "ingredients": [
      "1 cup all-purpose flour",
      "2 tablespoons cornstarch",
      "1 teaspoon baking powder",
      "½ teaspoon salt",
      "1 egg",
      "1 cup beer",
      "½ cup plain yogurt",
      "½ cup mayonnaise",
      "1 lime, juiced",
      "1 jalapeno pepper, minced",
      "1 teaspoon minced capers",
      "½ teaspoon dried oregano",
      "½ teaspoon ground cumin",
      "½ teaspoon dried dill weed",
      "1 teaspoon ground cayenne pepper",
      "1 quart oil for frying",
      "1 pound cod fillets, cut into 2 to 3 ounce portions",
      "1 (12 ounce) package corn tortillas",
      "½ medium head cabbage, finely shredded"
    ],
    "cookingInstructions": [
      "Step 1 To make beer batter: In a large bowl, combine flour, cornstarch, baking powder, and salt. Blend egg and beer, then quickly stir into the flour mixture (don\u0027t worry about a few lumps). ",
      "Step 2 To make white sauce: In a medium bowl, mix together yogurt and mayonnaise. Gradually stir in fresh lime juice until consistency is slightly runny. Season with jalapeno, capers, oregano, cumin, dill, and cayenne.",
      "Step 3 Heat oil in deep-fryer to 375 degrees F (190 degrees C).",
      "Step 4 Dust fish pieces lightly with flour. Dip into beer batter, and fry until crisp and golden brown. Drain on paper towels. Lightly fry tortillas; not too crisp. To serve, place fried fish in a tortilla, and top with shredded cabbage, and white sauce."
    ]
  },
  {
    "imageUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url\u003dhttps%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F54136.jpg",
    "recipeName": "Balsamic-Glazed Salmon Fillets",
    "recipeUrl": "https://www.allrecipes.com/recipe/82817/balsamic-glazed-salmon-fillets/",
    "ingredients": [
      "6 (5 ounce) salmon fillets",
      "4 cloves garlic, minced",
      "1 tablespoon white wine",
      "1 tablespoon honey",
      "⅓ cup balsamic vinegar",
      "4 teaspoons Dijon mustard",
      "salt and pepper to taste",
      "1 tablespoon chopped fresh oregano"
    ],
    "cookingInstructions": [
      "Step 1 Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil, and spray with non-stick cooking spray. ",
      "Step 2 Coat a small saucepan with non-stick cooking spray. Over medium heat, cook and stir garlic until soft, about 3 minutes. Mix in white wine, honey, balsamic vinegar, mustard, and salt and pepper. Simmer, uncovered, for about 3 minutes, or until slightly thickened.",
      "Step 3 Arrange salmon fillets on foil-lined baking sheet. Brush fillets with balsamic glaze, and sprinkle with oregano.",
      "Step 4 Bake in preheated oven for 10 to 14 minutes, or until flesh flakes easily with a fork. Brush fillets with remaining glaze, and season with salt and pepper. Use a spatula to transfer fillets to serving platter, leaving the skin behind on the foil."
    ]
  }
]